[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.AskReddit", "banned_by": null, "media_embed": {}, "subreddit": "AskReddit", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "4hx1co", "from_kind": null, "gilded": 0, "archived": false, "clicked": false, "report_reasons": null, "author": "Take42", "media": null, "name": "t3_4hx1co", "score": 29, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh1i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "mod_reports": [], "secure_media_embed": {}, "saved": false, "removal_reason": null, "stickied": false, "from": null, "is_self": true, "from_id": null, "permalink": "/r/AskReddit/comments/4hx1co/redditors_who_have_campedbackpacked_through_the/", "locked": false, "hide_score": false, "created": 1462430110.0, "url": "https://www.reddit.com/r/AskReddit/comments/4hx1co/redditors_who_have_campedbackpacked_through_the/", "author_flair_text": null, "quarantine": false, "title": "Redditors who have camped/backpacked through the remote wilderness, what was the creepiest or most unexplained thing you have seen or encountered while out there?", "created_utc": 1462401310.0, "ups": 29, "upvote_ratio": 0.82, "num_comments": 42, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2tegrj", "gilded": 0, "archived": false, "report_reasons": null, "author": "IWantAPuppyArmy", "parent_id": "t1_d2tdxki", "score": 6, "approved_by": null, "controversiality": 0, "body": "Haha! I did, but not to him. He also got married, to a dude. We're all very happy, and he's still my best friend.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha! I did, but not to him. He also got married, to a dude. We&amp;#39;re all very happy, and he&amp;#39;s still my best friend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2tegrj", "score_hidden": false, "stickied": false, "created": 1462449142.0, "author_flair_text": null, "created_utc": 1462420342.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 6}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2tdxki", "gilded": 0, "archived": false, "report_reasons": null, "author": "esplife03", "parent_id": "t1_d2t6y9o", "score": 1, "approved_by": null, "controversiality": 0, "body": "Soooo did you get married? ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Soooo did you get married? &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2tdxki", "score_hidden": false, "stickied": false, "created": 1462448138.0, "author_flair_text": null, "created_utc": 1462419338.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2tuk08", "gilded": 0, "archived": false, "report_reasons": null, "author": "IWantAPuppyArmy", "parent_id": "t1_d2tfklg", "score": 2, "approved_by": null, "controversiality": 0, "body": "That's pretty much all that went through my head. I also think my pack made me look bigger, and I started talking out loud because I don't think most wild animals like that. I just tried to not panic, even if I wasn't exactly calm the whole time.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s pretty much all that went through my head. I also think my pack made me look bigger, and I started talking out loud because I don&amp;#39;t think most wild animals like that. I just tried to not panic, even if I wasn&amp;#39;t exactly calm the whole time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2tuk08", "score_hidden": false, "stickied": false, "created": 1462489049.0, "author_flair_text": null, "created_utc": 1462460249.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2tfklg", "gilded": 0, "archived": false, "report_reasons": null, "author": "HookLineNStinker", "parent_id": "t1_d2t6y9o", "score": 1, "approved_by": null, "controversiality": 0, "body": "I am sure you have training and were hiking well before this experience, but as a bub girl, I surely would have fucking died. Panic then broken limb, then big cat dinner. In fact, the only thing probably keeping that cat from tackling your ass was that you didn't seem wounded and you're another big animal. If you started to limp, man, things might have gone a different way.    \n   \nEdit: Burb, not bub. whoops. ", "edited": 1462424705.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am sure you have training and were hiking well before this experience, but as a bub girl, I surely would have fucking died. Panic then broken limb, then big cat dinner. In fact, the only thing probably keeping that cat from tackling your ass was that you didn&amp;#39;t seem wounded and you&amp;#39;re another big animal. If you started to limp, man, things might have gone a different way.    &lt;/p&gt;\n\n&lt;p&gt;Edit: Burb, not bub. whoops. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2tfklg", "score_hidden": false, "stickied": false, "created": 1462451365.0, "author_flair_text": null, "created_utc": 1462422565.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t6y9o", "gilded": 0, "archived": false, "report_reasons": null, "author": "IWantAPuppyArmy", "parent_id": "t3_4hx1co", "score": 25, "approved_by": null, "controversiality": 0, "body": "I'll tell you this one because it's the only thing that has scared me enough to disregard my basic safety rules for backpacking alone:\n\nI went on what was supposed to be a 3 day, 2 night solo backpacking trip on the Continental Divide in Colorado. I mapped it out and went to a local Forest Service office for advice on the best camping spots with good cover, took their advice, gave my then-boyfriend and my mom the coordinates I would be camping at and the times I should roughly get to each spot. I checked the weather and it was supposed to be a little spotty but nothing to be concerned about. I even did the math for the rough number of calories I would burn for each hour of hiking, given the altitude, and had enough Snickers to offset the calorie burn. Pretty clever girl, right?\n\nSo the first day and night went great. I passed a few day hikers on the trail, made it to my first camping spot and had an alpine lake all to myself and ate dinner watching the sunset and read my book and fell asleep. Day two I woke up to the sunrise over that lake, and a bunch of deer hanging out by my tent. Pretty fucking magical. I lumbered along on top of the Divide for most of the day. Saw some cool remnants of train tracks and mines and trestles and shit. Ate my snickers. Early afternoon, there are clouds building way more than they should have been. Oooookay, not great but not a big deal because the Ranger I talked to raaaaaved about my camping spot for night two and I was making good time. \n\nFirst snag: There... was a bull moose. I've never even seen a fucking moose in real life. But I have heard enough stories that they get angry and you have to just stay out of their way until they move on on their own. A truck of hunters drove by me and we talked for a minute and I asked them what I should do, and they pointed to rocks, which were the only cover for another half mile or so, and told me to sit behind them until it wanders away. So I did. Waiting ate up a few hours and by the time it was gone from the trail the sky was overcast and the clouds were much closer and, oh, what's this? Clouds building on the other side of the divide too? Perfect! So I basically trotted the next two miles with my pack to what was supposed to be a safe haven.\n\nLol. Second Snag: This spot was supposed to be right off the trail, with older-growth trees and sheltered by mountain peaks. It was none of those things. It was far and down a considerable ways from the trail. It was exposed rock with some scraggly, pathetic high-altitude pines. It was not at all going to help me. The clouds are now on almost on top of me, it's hailing, and I'm standing under this foot-wide awning of a sign, which is a stupid thing to do if there's lightning, but honestly there wasn't any LESS stupid place for me to stand. I had my cell phone out and got enough signal to send my best friend and roommate a text saying \"Weather is bad, not safe, looking for shelter around X area.\" At this point some mountain bikers rode up to the same awning to get out of the hail and they knew the area better and said my only shot, really, to get out of the weather was a collapsed train tunnel about a mile back across the Divide. \n\nTime to just suck it up and haul ass to this creepy-sounding train tunnel! So I did. I ran again, with my pack on, and... couldn't find it. Or at least these guys had so seriously embellished the safe-cavern aspect of it that it was ridiculous. I found big rocks and a trestle and more big rocks, but nothing to actually hide in. It's not like I could have missed it, so far above the tree line there's nothing to hide it from sight. And the second set of clouds was pure black and getting closer and it's still raining. I didn't know what else to do except go back to the closest point to the coordinates I said I'd be at and where where I had some spotty cell service and try to get another message out. I backtracked across my own boot prints and felt even more uneasy and couldn't figure out why until I focused on the boot prints. \n\nThey... weren't just my boot prints. Following them and clearly on TOP of them were Mountain Lion tracks. My heart was in my throat so fast I almost threw up. I immediately crammed myself in between two bigger rocks because I guess I felt like maybe the mountain lion would be too lazy to pry me out a rock sandwich? I don't know, all I know is that this was really, really bad. Eventually the approaching thunder scared me just marginally more than the mountain lion, so I kept to my plan and hustled back to the awning, expecting to feel claws and jaws ripping across my pack every second.\n\nI made it to the awning, got out my cell phone and map and snickers (because at this point I had already exceeded my planned mileage for the day, on 1/3 the planned calories, and being exhausted makes you even dumber and more likely to get hurt than blind terror). I got one more message out to my friend and named a lake that was supposed to be near the end of Day 3's hike. It was the closest to a navigable road on his side of the Divide. I made up my mind to do what I normally wouldn't even entertain the thought of and head back out across the Divide and down the other side and to navigate a totally unfamiliar trail, half above the tree line, shortly before sundown. It just seemed like better odds than the storm and the mountain lion. \n\nI had to go back across the exact same route to get there, though. And on top of my even-fresher boot prints were more mountain lion tracks. I hadn't seen any movement, I hadn't seen anything at all, but that confirmation that I was, without a doubt, being stalked invisibly was more terrifying that almost anything else could have been. \n\nThrough all of this I had skipped my lunch, thinking I'd be able to make camp and eat to make up for it. I was getting colder than I should be, I felt clumsier and I was getting confused over things I shouldn't have been but I could think clearly enough to recognize that on top of all of this bullshit, I was showing signs of exhaustion. And that is also very dangerous, but I didn't feel like I could safely stop to eat until I reached this lake, which I knew was popular for weekend jeep enthusiasts and fishing. \n\nI just kept walking and started crying. This was the stupidest situation to be in. Not backpacking alone (I will always do it), but just... being where I was when I was. I should have turned around at the first sign of the storm and headed for my first campsite because I KNEW it was safe. But I didn't. And now I was SURE I heard rocks being knocked down hill behind and above me.\n\nI just ran. I made fast navigation decisions and cut out some distance that way but found myself at the top of a snowfield. Maybe it was a glacier, I don't know, but I also was totally unprepared for navigating this. Especially in the rain, especially now that the sun was almost down. I decided to check my phone one last time, just to see if there was any kind of help coming and there was one message: \"Already on my way.\" That's all I needed to know. I scooted/slid down on my ass and hoped I wouldn't land wrong at the bottom.\n\nI landed fine, and shortly thereafter I was below the tree line. But I was done, mentally, and physically beyond exhausted. Soaking wet and scared I got out my headlamp but was so afraid I would see eyes glowing back at me that the light wasn't reassuring at all. At this point, though, all of my outdoor training kicked in and the threat of hypothermia combined with exhaustion wormed its way to the front of my list of things-that-are-making-me-cry-like-a-fucking-baby and I knew that I had to get to someplace I could get warm and eat. So I put my pack back on and kept running. I knew roughly which way the trail should be going, and from my topo map I knew there shouldn't be any cliffs to eat shit and die falling from, so I ran as fast as this logic allowed.\n\nSoon enough I saw fires going and *headlights*. I KNEW it had to be my friend. I started crying harder from relief but realized he was still a good ways off, and that his being here wouldn't help me if I broke my leg and had to crawl, so I slowed down. \n\nI got close enough to the camp to see the light reflecting off the jeeps before it hit me: I was about to willingly walk into a camp of most-likely all men, alone, on the assumption that it WAS my friend who would be there shortly. This gave me enough cause for concern that, ignoring my fear of the mountain lion I stood in the pitch dark and weighed my options. The dropping temperature made my mind up for me and I just went for it. I walked right into their fire ring and their dogs went ballistic but I think a crazed, bleeding, shivering white girl appearing out of the woods scared them so badly they wouldn't have tried anything on me even if I had been mid-90's Pam Anderson. \n\nSo a bunch of redneck dudes took my pack off and got me a blanket and gave me a gatorade, which made me laugh and ask for whiskey because fuck that shit right now, and asked me what the hell happened. I told them, and told them my friend was coming, and they delivered the news: the headlights I had seen WERE my friend's, but they weren't coming into camp, they were driving away from it when I saw them. He had already been there and asked around about me and left. When they saw the look on my face they didn't even ask me, one of them just jumped in his jeep and tore ass out of there a WAY faster than any safety on that road warranted, and went to find my friend.\n\nHe did. And my best friend in the entire world came back for me and took me down the mountain. It had taken him HOURS to get up the mountain, on a high-clearance 4WD jeep road, in his Honda Civic (RIP, that car). I still don't know how he did it.\n\n**TL;DR: Tiny woman backpacking alone, get's caught in a storm above treeline and stalked by a mountain lion, gets rescued by the most intrepid Honda Civic driver that ever lived.**", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll tell you this one because it&amp;#39;s the only thing that has scared me enough to disregard my basic safety rules for backpacking alone:&lt;/p&gt;\n\n&lt;p&gt;I went on what was supposed to be a 3 day, 2 night solo backpacking trip on the Continental Divide in Colorado. I mapped it out and went to a local Forest Service office for advice on the best camping spots with good cover, took their advice, gave my then-boyfriend and my mom the coordinates I would be camping at and the times I should roughly get to each spot. I checked the weather and it was supposed to be a little spotty but nothing to be concerned about. I even did the math for the rough number of calories I would burn for each hour of hiking, given the altitude, and had enough Snickers to offset the calorie burn. Pretty clever girl, right?&lt;/p&gt;\n\n&lt;p&gt;So the first day and night went great. I passed a few day hikers on the trail, made it to my first camping spot and had an alpine lake all to myself and ate dinner watching the sunset and read my book and fell asleep. Day two I woke up to the sunrise over that lake, and a bunch of deer hanging out by my tent. Pretty fucking magical. I lumbered along on top of the Divide for most of the day. Saw some cool remnants of train tracks and mines and trestles and shit. Ate my snickers. Early afternoon, there are clouds building way more than they should have been. Oooookay, not great but not a big deal because the Ranger I talked to raaaaaved about my camping spot for night two and I was making good time. &lt;/p&gt;\n\n&lt;p&gt;First snag: There... was a bull moose. I&amp;#39;ve never even seen a fucking moose in real life. But I have heard enough stories that they get angry and you have to just stay out of their way until they move on on their own. A truck of hunters drove by me and we talked for a minute and I asked them what I should do, and they pointed to rocks, which were the only cover for another half mile or so, and told me to sit behind them until it wanders away. So I did. Waiting ate up a few hours and by the time it was gone from the trail the sky was overcast and the clouds were much closer and, oh, what&amp;#39;s this? Clouds building on the other side of the divide too? Perfect! So I basically trotted the next two miles with my pack to what was supposed to be a safe haven.&lt;/p&gt;\n\n&lt;p&gt;Lol. Second Snag: This spot was supposed to be right off the trail, with older-growth trees and sheltered by mountain peaks. It was none of those things. It was far and down a considerable ways from the trail. It was exposed rock with some scraggly, pathetic high-altitude pines. It was not at all going to help me. The clouds are now on almost on top of me, it&amp;#39;s hailing, and I&amp;#39;m standing under this foot-wide awning of a sign, which is a stupid thing to do if there&amp;#39;s lightning, but honestly there wasn&amp;#39;t any LESS stupid place for me to stand. I had my cell phone out and got enough signal to send my best friend and roommate a text saying &amp;quot;Weather is bad, not safe, looking for shelter around X area.&amp;quot; At this point some mountain bikers rode up to the same awning to get out of the hail and they knew the area better and said my only shot, really, to get out of the weather was a collapsed train tunnel about a mile back across the Divide. &lt;/p&gt;\n\n&lt;p&gt;Time to just suck it up and haul ass to this creepy-sounding train tunnel! So I did. I ran again, with my pack on, and... couldn&amp;#39;t find it. Or at least these guys had so seriously embellished the safe-cavern aspect of it that it was ridiculous. I found big rocks and a trestle and more big rocks, but nothing to actually hide in. It&amp;#39;s not like I could have missed it, so far above the tree line there&amp;#39;s nothing to hide it from sight. And the second set of clouds was pure black and getting closer and it&amp;#39;s still raining. I didn&amp;#39;t know what else to do except go back to the closest point to the coordinates I said I&amp;#39;d be at and where where I had some spotty cell service and try to get another message out. I backtracked across my own boot prints and felt even more uneasy and couldn&amp;#39;t figure out why until I focused on the boot prints. &lt;/p&gt;\n\n&lt;p&gt;They... weren&amp;#39;t just my boot prints. Following them and clearly on TOP of them were Mountain Lion tracks. My heart was in my throat so fast I almost threw up. I immediately crammed myself in between two bigger rocks because I guess I felt like maybe the mountain lion would be too lazy to pry me out a rock sandwich? I don&amp;#39;t know, all I know is that this was really, really bad. Eventually the approaching thunder scared me just marginally more than the mountain lion, so I kept to my plan and hustled back to the awning, expecting to feel claws and jaws ripping across my pack every second.&lt;/p&gt;\n\n&lt;p&gt;I made it to the awning, got out my cell phone and map and snickers (because at this point I had already exceeded my planned mileage for the day, on 1/3 the planned calories, and being exhausted makes you even dumber and more likely to get hurt than blind terror). I got one more message out to my friend and named a lake that was supposed to be near the end of Day 3&amp;#39;s hike. It was the closest to a navigable road on his side of the Divide. I made up my mind to do what I normally wouldn&amp;#39;t even entertain the thought of and head back out across the Divide and down the other side and to navigate a totally unfamiliar trail, half above the tree line, shortly before sundown. It just seemed like better odds than the storm and the mountain lion. &lt;/p&gt;\n\n&lt;p&gt;I had to go back across the exact same route to get there, though. And on top of my even-fresher boot prints were more mountain lion tracks. I hadn&amp;#39;t seen any movement, I hadn&amp;#39;t seen anything at all, but that confirmation that I was, without a doubt, being stalked invisibly was more terrifying that almost anything else could have been. &lt;/p&gt;\n\n&lt;p&gt;Through all of this I had skipped my lunch, thinking I&amp;#39;d be able to make camp and eat to make up for it. I was getting colder than I should be, I felt clumsier and I was getting confused over things I shouldn&amp;#39;t have been but I could think clearly enough to recognize that on top of all of this bullshit, I was showing signs of exhaustion. And that is also very dangerous, but I didn&amp;#39;t feel like I could safely stop to eat until I reached this lake, which I knew was popular for weekend jeep enthusiasts and fishing. &lt;/p&gt;\n\n&lt;p&gt;I just kept walking and started crying. This was the stupidest situation to be in. Not backpacking alone (I will always do it), but just... being where I was when I was. I should have turned around at the first sign of the storm and headed for my first campsite because I KNEW it was safe. But I didn&amp;#39;t. And now I was SURE I heard rocks being knocked down hill behind and above me.&lt;/p&gt;\n\n&lt;p&gt;I just ran. I made fast navigation decisions and cut out some distance that way but found myself at the top of a snowfield. Maybe it was a glacier, I don&amp;#39;t know, but I also was totally unprepared for navigating this. Especially in the rain, especially now that the sun was almost down. I decided to check my phone one last time, just to see if there was any kind of help coming and there was one message: &amp;quot;Already on my way.&amp;quot; That&amp;#39;s all I needed to know. I scooted/slid down on my ass and hoped I wouldn&amp;#39;t land wrong at the bottom.&lt;/p&gt;\n\n&lt;p&gt;I landed fine, and shortly thereafter I was below the tree line. But I was done, mentally, and physically beyond exhausted. Soaking wet and scared I got out my headlamp but was so afraid I would see eyes glowing back at me that the light wasn&amp;#39;t reassuring at all. At this point, though, all of my outdoor training kicked in and the threat of hypothermia combined with exhaustion wormed its way to the front of my list of things-that-are-making-me-cry-like-a-fucking-baby and I knew that I had to get to someplace I could get warm and eat. So I put my pack back on and kept running. I knew roughly which way the trail should be going, and from my topo map I knew there shouldn&amp;#39;t be any cliffs to eat shit and die falling from, so I ran as fast as this logic allowed.&lt;/p&gt;\n\n&lt;p&gt;Soon enough I saw fires going and &lt;em&gt;headlights&lt;/em&gt;. I KNEW it had to be my friend. I started crying harder from relief but realized he was still a good ways off, and that his being here wouldn&amp;#39;t help me if I broke my leg and had to crawl, so I slowed down. &lt;/p&gt;\n\n&lt;p&gt;I got close enough to the camp to see the light reflecting off the jeeps before it hit me: I was about to willingly walk into a camp of most-likely all men, alone, on the assumption that it WAS my friend who would be there shortly. This gave me enough cause for concern that, ignoring my fear of the mountain lion I stood in the pitch dark and weighed my options. The dropping temperature made my mind up for me and I just went for it. I walked right into their fire ring and their dogs went ballistic but I think a crazed, bleeding, shivering white girl appearing out of the woods scared them so badly they wouldn&amp;#39;t have tried anything on me even if I had been mid-90&amp;#39;s Pam Anderson. &lt;/p&gt;\n\n&lt;p&gt;So a bunch of redneck dudes took my pack off and got me a blanket and gave me a gatorade, which made me laugh and ask for whiskey because fuck that shit right now, and asked me what the hell happened. I told them, and told them my friend was coming, and they delivered the news: the headlights I had seen WERE my friend&amp;#39;s, but they weren&amp;#39;t coming into camp, they were driving away from it when I saw them. He had already been there and asked around about me and left. When they saw the look on my face they didn&amp;#39;t even ask me, one of them just jumped in his jeep and tore ass out of there a WAY faster than any safety on that road warranted, and went to find my friend.&lt;/p&gt;\n\n&lt;p&gt;He did. And my best friend in the entire world came back for me and took me down the mountain. It had taken him HOURS to get up the mountain, on a high-clearance 4WD jeep road, in his Honda Civic (RIP, that car). I still don&amp;#39;t know how he did it.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR: Tiny woman backpacking alone, get&amp;#39;s caught in a storm above treeline and stalked by a mountain lion, gets rescued by the most intrepid Honda Civic driver that ever lived.&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t6y9o", "score_hidden": false, "stickied": false, "created": 1462437099.0, "author_flair_text": null, "created_utc": 1462408299.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 25}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2t6erg", "gilded": 0, "archived": false, "report_reasons": null, "author": "WayTooFurry", "parent_id": "t1_d2t5rhs", "score": 3, "approved_by": null, "controversiality": 0, "body": "Tell me about it. I felt like I was living in a sub-par horror movie. I hope it was just a couple of kids trying to be edgy on their camping trip but it really freaked me out.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell me about it. I felt like I was living in a sub-par horror movie. I hope it was just a couple of kids trying to be edgy on their camping trip but it really freaked me out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t6erg", "score_hidden": false, "stickied": false, "created": 1462436287.0, "author_flair_text": null, "created_utc": 1462407487.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t5rhs", "gilded": 0, "archived": false, "report_reasons": null, "author": "Take42", "parent_id": "t1_d2t3o2j", "score": 3, "approved_by": null, "controversiality": 0, "body": "Oh jeez, worrying and imagining that someone or something is out there is one thing, but the idea of *knowing* some strange person is nearby, and not knowing their motives... That is bone chilling.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh jeez, worrying and imagining that someone or something is out there is one thing, but the idea of &lt;em&gt;knowing&lt;/em&gt; some strange person is nearby, and not knowing their motives... That is bone chilling.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t5rhs", "score_hidden": false, "stickied": false, "created": 1462435296.0, "author_flair_text": null, "created_utc": 1462406496.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2t4cs8", "gilded": 0, "archived": false, "report_reasons": null, "author": "WayTooFurry", "parent_id": "t1_d2t49fy", "score": 4, "approved_by": null, "controversiality": 0, "body": "I'll definetly see what I can do", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll definetly see what I can do&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t4cs8", "score_hidden": false, "stickied": false, "created": 1462433069.0, "author_flair_text": null, "created_utc": 1462404269.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t49fy", "gilded": 0, "archived": false, "report_reasons": null, "author": "modog11", "parent_id": "t1_d2t46y0", "score": 2, "approved_by": null, "controversiality": 0, "body": "I suspect if you got them to scan them and send them there'd be plenty of interest! ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I suspect if you got them to scan them and send them there&amp;#39;d be plenty of interest! &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t49fy", "score_hidden": false, "stickied": false, "created": 1462432927.0, "author_flair_text": null, "created_utc": 1462404127.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t46y0", "gilded": 0, "archived": false, "report_reasons": null, "author": "WayTooFurry", "parent_id": "t1_d2t3yvo", "score": 2, "approved_by": null, "controversiality": 0, "body": "The only camera I had was one owned by the camp. I did take a few photos of the cabin and one of the portage sign but only to show my camp director. I think I have a couple hard copies of them at my parents house but none on hand currently.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only camera I had was one owned by the camp. I did take a few photos of the cabin and one of the portage sign but only to show my camp director. I think I have a couple hard copies of them at my parents house but none on hand currently.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t46y0", "score_hidden": false, "stickied": false, "created": 1462432820.0, "author_flair_text": null, "created_utc": 1462404020.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t3yvo", "gilded": 0, "archived": false, "report_reasons": null, "author": "modog11", "parent_id": "t1_d2t3o2j", "score": 2, "approved_by": null, "controversiality": 0, "body": "I would have photographed it.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I would have photographed it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t3yvo", "score_hidden": false, "stickied": false, "created": 1462432477.0, "author_flair_text": null, "created_utc": 1462403677.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2yrrl0", "gilded": 0, "archived": false, "report_reasons": null, "author": "IWantAPuppyArmy", "parent_id": "t1_d2t3o2j", "score": 1, "approved_by": null, "controversiality": 0, "body": "oooooooooof, this would freak me the fuck out. I was once on a backcountry solo trail running trip, where I hiked back and set up a camp and used that as a base for trail running excursions. I woke up before dawn and set out for a 10 mile summit run and *of course* the first stand of thick fir &amp; pine trees I hit has a layer of mist around the bases, and it's super dark underneath the canopy so it took a minute for my eyes to adjust. By the time the did I was pretty far into that section of trail and realized that the lighter-colored things hanging low on the branches weren't pine cones. They were bones. All kinds of small animal bones. Logically I knew that it was just a silly thing people started doing, but I ran much, much faster than I planned for until I hit daylight again. Can't imagine like... finding those bones moved back to my campsite. I'd shit myself.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oooooooooof, this would freak me the fuck out. I was once on a backcountry solo trail running trip, where I hiked back and set up a camp and used that as a base for trail running excursions. I woke up before dawn and set out for a 10 mile summit run and &lt;em&gt;of course&lt;/em&gt; the first stand of thick fir &amp;amp; pine trees I hit has a layer of mist around the bases, and it&amp;#39;s super dark underneath the canopy so it took a minute for my eyes to adjust. By the time the did I was pretty far into that section of trail and realized that the lighter-colored things hanging low on the branches weren&amp;#39;t pine cones. They were bones. All kinds of small animal bones. Logically I knew that it was just a silly thing people started doing, but I ran much, much faster than I planned for until I hit daylight again. Can&amp;#39;t imagine like... finding those bones moved back to my campsite. I&amp;#39;d shit myself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2yrrl0", "score_hidden": false, "stickied": false, "created": 1462841390.0, "author_flair_text": null, "created_utc": 1462812590.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t3o2j", "gilded": 0, "archived": false, "report_reasons": null, "author": "WayTooFurry", "parent_id": "t3_4hx1co", "score": 13, "approved_by": null, "controversiality": 0, "body": "I have a few but this is the creepiest.\n\nA couple of years back I was leading a trip North of the Temagami region of Ontario. Now, I'm talking about a remote area. We are at least a 12 hour paddle to the nearest road or fishing camp.\n \nAfter a particularly hard day of paddling we set up camp on this small lake. Because everyone else was pretty tired I went to do the pack hang in this small stand of trees just behind our campsite. In this stand of trees I found an old hunting cabin so I decided to go inside... this was a mistake. \n\nThe cabin was small, maybe 10ft x 10ft, and it smelt really weird. Because of how dark it was at this point, especially in the cabin as the windows were boarded up, I turned on my headlamp. After getting my light on I looked up to the single most horrific sight I have seen. All throughout the cabin there were pentagrams drawn and carved into the walls, old doll heads hanging from the ceiling, and bones of dead animals all over but the creepiest thing in the building was by far the body of a snapping turtle nailed to the wall by it's hands and feet. \n\nMost of the stuff in that cabin was very old and looked like it had been left there for at least a decade and there was a thick layer of dirt and dust on the floor. Even the carvings and drawings seemed to have been there for a while. The turtle however was fresh and the blood that had pooled underneath it couldn't have been more that a day or two old. On top of this there were two candles that looked to be freshly burnt. \n\nI made a quick retreat from the cabin and informed my co-guide what I had found and she agreed with my initial assessment of the cabin. We sort of guessed that whoever had done this couldn't have been gone for more that a day. Unfortunately it was now after dark and we were unable to continue on and leave that campsite so we didn't tell our campers and proceeded to spend the night. \n\nAt around 2 am I woke up to the sound of something moving in the bushes in between our campsite and the cabin so I got up to check it out. Armed with a knife, some bear spray, and a flashlight I walked out in the direction of the cabin. I couldn't find any sign of anything until I reached the door of the cabin. Inside I found fresh footprints in the dirt and dust on the floor of the old building but nothing through the mud leading to the door. I entered the cabin and I took a look around, nothing had been moved except for the turtle which was now missing. Assuming I missed the footprints of whoever was moving around out there so I took a quick look around but the only footprints that were outside were those of my co-guide and myself and neither of our footprints matched the new ones inside of the old hunting cabin. \n\nAfter I figured this out I made a quick get away to our campsite and started a fire in the fire pit. I set up on the far side of the fire and kept watch the rest of the night. \n\nAt first light we were out of there and proceeded to the next portage. One of my campers got there first and when she got to the entrance to the trail she screamed. Nailed to the sign of the portage was the same turtle me and my co-guide found in the cabin. \n\nNeedless to say I have never got back to that site even though I have led two additional trips through that area.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a few but this is the creepiest.&lt;/p&gt;\n\n&lt;p&gt;A couple of years back I was leading a trip North of the Temagami region of Ontario. Now, I&amp;#39;m talking about a remote area. We are at least a 12 hour paddle to the nearest road or fishing camp.&lt;/p&gt;\n\n&lt;p&gt;After a particularly hard day of paddling we set up camp on this small lake. Because everyone else was pretty tired I went to do the pack hang in this small stand of trees just behind our campsite. In this stand of trees I found an old hunting cabin so I decided to go inside... this was a mistake. &lt;/p&gt;\n\n&lt;p&gt;The cabin was small, maybe 10ft x 10ft, and it smelt really weird. Because of how dark it was at this point, especially in the cabin as the windows were boarded up, I turned on my headlamp. After getting my light on I looked up to the single most horrific sight I have seen. All throughout the cabin there were pentagrams drawn and carved into the walls, old doll heads hanging from the ceiling, and bones of dead animals all over but the creepiest thing in the building was by far the body of a snapping turtle nailed to the wall by it&amp;#39;s hands and feet. &lt;/p&gt;\n\n&lt;p&gt;Most of the stuff in that cabin was very old and looked like it had been left there for at least a decade and there was a thick layer of dirt and dust on the floor. Even the carvings and drawings seemed to have been there for a while. The turtle however was fresh and the blood that had pooled underneath it couldn&amp;#39;t have been more that a day or two old. On top of this there were two candles that looked to be freshly burnt. &lt;/p&gt;\n\n&lt;p&gt;I made a quick retreat from the cabin and informed my co-guide what I had found and she agreed with my initial assessment of the cabin. We sort of guessed that whoever had done this couldn&amp;#39;t have been gone for more that a day. Unfortunately it was now after dark and we were unable to continue on and leave that campsite so we didn&amp;#39;t tell our campers and proceeded to spend the night. &lt;/p&gt;\n\n&lt;p&gt;At around 2 am I woke up to the sound of something moving in the bushes in between our campsite and the cabin so I got up to check it out. Armed with a knife, some bear spray, and a flashlight I walked out in the direction of the cabin. I couldn&amp;#39;t find any sign of anything until I reached the door of the cabin. Inside I found fresh footprints in the dirt and dust on the floor of the old building but nothing through the mud leading to the door. I entered the cabin and I took a look around, nothing had been moved except for the turtle which was now missing. Assuming I missed the footprints of whoever was moving around out there so I took a quick look around but the only footprints that were outside were those of my co-guide and myself and neither of our footprints matched the new ones inside of the old hunting cabin. &lt;/p&gt;\n\n&lt;p&gt;After I figured this out I made a quick get away to our campsite and started a fire in the fire pit. I set up on the far side of the fire and kept watch the rest of the night. &lt;/p&gt;\n\n&lt;p&gt;At first light we were out of there and proceeded to the next portage. One of my campers got there first and when she got to the entrance to the trail she screamed. Nailed to the sign of the portage was the same turtle me and my co-guide found in the cabin. &lt;/p&gt;\n\n&lt;p&gt;Needless to say I have never got back to that site even though I have led two additional trips through that area.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t3o2j", "score_hidden": false, "stickied": false, "created": 1462432010.0, "author_flair_text": null, "created_utc": 1462403210.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2yru0k", "gilded": 0, "archived": false, "report_reasons": null, "author": "IWantAPuppyArmy", "parent_id": "t1_d2t9g3u", "score": 1, "approved_by": null, "controversiality": 0, "body": "I've seen some things like that, and it always makes me kind of sad. Then again, I've certainly taken some stuff out to the woods and shot it for some catharsis... ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen some things like that, and it always makes me kind of sad. Then again, I&amp;#39;ve certainly taken some stuff out to the woods and shot it for some catharsis... &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2yru0k", "score_hidden": false, "stickied": false, "created": 1462841479.0, "author_flair_text": null, "created_utc": 1462812679.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t9g3u", "gilded": 0, "archived": false, "report_reasons": null, "author": "Quafl", "parent_id": "t3_4hx1co", "score": 6, "approved_by": null, "controversiality": 0, "body": "I came across an area where it looked like love died. \n\nI found love letters, honeymoon photos, teddy bears, and other small gifts all blown to pieces by a shotgun.\n\nI felt all sorts of heebie-jeebies that made my skin crawl.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I came across an area where it looked like love died. &lt;/p&gt;\n\n&lt;p&gt;I found love letters, honeymoon photos, teddy bears, and other small gifts all blown to pieces by a shotgun.&lt;/p&gt;\n\n&lt;p&gt;I felt all sorts of heebie-jeebies that made my skin crawl.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t9g3u", "score_hidden": false, "stickied": false, "created": 1462440809.0, "author_flair_text": null, "created_utc": 1462412009.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2tffsv", "gilded": 0, "archived": false, "report_reasons": null, "author": "Take42", "parent_id": "t1_d2tagu6", "score": 1, "approved_by": null, "controversiality": 0, "body": "What! That's so weird! Do you still remember what it looked like, vividly? Any chance of a sketch?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What! That&amp;#39;s so weird! Do you still remember what it looked like, vividly? Any chance of a sketch?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2tffsv", "score_hidden": false, "stickied": false, "created": 1462451085.0, "author_flair_text": null, "created_utc": 1462422285.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2tagu6", "gilded": 0, "archived": false, "report_reasons": null, "author": "sirDragonslut", "parent_id": "t3_4hx1co", "score": 7, "approved_by": null, "controversiality": 0, "body": "While packing through The Golden Trout Wilderness in California we accidentally killed the biggest most alien looking bug you can imagine.  When I say accidentally, I mean I swatted it while speaking with my hands. This abomination was as big as a closed fist, two in line proboscises, and a ribbed abdomen. Ribbed as in it looked like prune with deeper recesses and folds. When I hit it, it died instantly, we bagged it, and the following morning it had turned into liquid, with no trace of the exoskeleton or anything. \n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;While packing through The Golden Trout Wilderness in California we accidentally killed the biggest most alien looking bug you can imagine.  When I say accidentally, I mean I swatted it while speaking with my hands. This abomination was as big as a closed fist, two in line proboscises, and a ribbed abdomen. Ribbed as in it looked like prune with deeper recesses and folds. When I hit it, it died instantly, we bagged it, and the following morning it had turned into liquid, with no trace of the exoskeleton or anything. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2tagu6", "score_hidden": false, "stickied": false, "created": 1462442366.0, "author_flair_text": null, "created_utc": 1462413566.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 7}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2t6qvw", "gilded": 0, "archived": false, "report_reasons": null, "author": "Take42", "parent_id": "t1_d2t3cd8", "score": 2, "approved_by": null, "controversiality": 0, "body": "From Washington here too - thankfully I haven't encountered any booby traps while out hiking around, but we have been followed by a few sketchy cars and told to go down a random dirt road by a \"police officer\" who was on foot without a car in the middle of nowhere, who appeared from nowhere when we pulled over to figure out where a party we were going to was at... Turned out to be back the way we came.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From Washington here too - thankfully I haven&amp;#39;t encountered any booby traps while out hiking around, but we have been followed by a few sketchy cars and told to go down a random dirt road by a &amp;quot;police officer&amp;quot; who was on foot without a car in the middle of nowhere, who appeared from nowhere when we pulled over to figure out where a party we were going to was at... Turned out to be back the way we came.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t6qvw", "score_hidden": false, "stickied": false, "created": 1462436795.0, "author_flair_text": null, "created_utc": 1462407995.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t3cd8", "gilded": 0, "archived": false, "report_reasons": null, "author": "giveen", "parent_id": "t3_4hx1co", "score": 4, "approved_by": null, "controversiality": 0, "body": "I've run across quite a few booby trapped meth labs in the back woods of Washington state.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve run across quite a few booby trapped meth labs in the back woods of Washington state.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t3cd8", "score_hidden": false, "stickied": false, "created": 1462431520.0, "author_flair_text": null, "created_utc": 1462402720.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2tf5wy", "gilded": 0, "archived": false, "report_reasons": null, "author": "weeble_weeble", "parent_id": "t1_d2t8smd", "score": 3, "approved_by": null, "controversiality": 0, "body": "So that's what the fox says!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So that&amp;#39;s what the fox says!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2tf5wy", "score_hidden": false, "stickied": false, "created": 1462450523.0, "author_flair_text": null, "created_utc": 1462421723.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t8smd", "gilded": 0, "archived": false, "report_reasons": null, "author": "Take42", "parent_id": "t1_d2t7d95", "score": 5, "approved_by": null, "controversiality": 0, "body": "Fox screams are terrifying when you aren't expecting them!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Fox screams are terrifying when you aren&amp;#39;t expecting them!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t8smd", "score_hidden": false, "stickied": false, "created": 1462439789.0, "author_flair_text": null, "created_utc": 1462410989.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t7d95", "gilded": 0, "archived": false, "report_reasons": null, "author": "idiputchko", "parent_id": "t3_4hx1co", "score": 4, "approved_by": null, "controversiality": 0, "body": "I have a cabin in the middle of the woods. I go there once in a while to clear my head. The first time I went, I didn't feel like sleeping inside the cabin. One night around 3am I heard a loud, high pitched desperate scream. My heart was pounding and my eyes were wide open, but since it was pitch black I could hear nothing. Turns out it was this - https://www.youtube.com/watch?v=qwiwqKE-moo", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a cabin in the middle of the woods. I go there once in a while to clear my head. The first time I went, I didn&amp;#39;t feel like sleeping inside the cabin. One night around 3am I heard a loud, high pitched desperate scream. My heart was pounding and my eyes were wide open, but since it was pitch black I could hear nothing. Turns out it was this - &lt;a href=\"https://www.youtube.com/watch?v=qwiwqKE-moo\"&gt;https://www.youtube.com/watch?v=qwiwqKE-moo&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t7d95", "score_hidden": false, "stickied": false, "created": 1462437726.0, "author_flair_text": null, "created_utc": 1462408926.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2t6uz9", "gilded": 0, "archived": false, "report_reasons": null, "author": "QuadrasaurusFlex", "parent_id": "t1_d2t6gq1", "score": 1, "approved_by": null, "controversiality": 0, "body": "Haha it could've been nothing, but I'd rather not have found it in case it was something.\n\nYeah that whole scene you described sounds terrifying. I would've noped so hard!\n\nThe girlfriend keeps saying she wants me to take her camping. I already know she won't dig the no showers/electricity game, I can't wait til she gets her first taste of potential spooky shit.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha it could&amp;#39;ve been nothing, but I&amp;#39;d rather not have found it in case it was something.&lt;/p&gt;\n\n&lt;p&gt;Yeah that whole scene you described sounds terrifying. I would&amp;#39;ve noped so hard!&lt;/p&gt;\n\n&lt;p&gt;The girlfriend keeps saying she wants me to take her camping. I already know she won&amp;#39;t dig the no showers/electricity game, I can&amp;#39;t wait til she gets her first taste of potential spooky shit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t6uz9", "score_hidden": false, "stickied": false, "created": 1462436961.0, "author_flair_text": null, "created_utc": 1462408161.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t6gq1", "gilded": 0, "archived": false, "report_reasons": null, "author": "Take42", "parent_id": "t1_d2t455a", "score": 5, "approved_by": null, "controversiality": 0, "body": "Imagining seeing something like that just feet away near the fire, with no idea what it is, and not being able to decipher any real shape or what it's saying...NOPE.\n\nThough that said, it was probably a curious animal; I've had a few odd animal encounters while out camping before. Once when I was camping up in the hills of Washington, I woke up in the early morning, around 4 AM, to my friend's dog staring intently at the wall of the tent, whining quietly. I pet and console her and was trying to figure out what she had heard, when I started to hear this huffing sound and then these weird ungodly calls from something just feet from the tent. After a few thuds on the ground outside, and some more calls, I start hearing something *mimicking the dog's whine* between the calls. I sat frozen for a bit, scared I was about to be skinned alive and eaten by some skinwalker, until I finally built up the courage to peak out the tent and see what it was. I slowly crept to the zipper, pulled it down as quietly as I could, peaked out, and I saw... A small group of deer were just chilling in our camp, taking turns drinking water from the river we were camped out next to! The mimicking was coming from a nearby Stellar's Jay, and deer apparently just happen to sound like hungry bear demons when it's 4 AM in the middle of nowhere. That's how I learned that Jay's will mimic sounds, and that my friend would probably sleep through the apocalypse given the chance.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Imagining seeing something like that just feet away near the fire, with no idea what it is, and not being able to decipher any real shape or what it&amp;#39;s saying...NOPE.&lt;/p&gt;\n\n&lt;p&gt;Though that said, it was probably a curious animal; I&amp;#39;ve had a few odd animal encounters while out camping before. Once when I was camping up in the hills of Washington, I woke up in the early morning, around 4 AM, to my friend&amp;#39;s dog staring intently at the wall of the tent, whining quietly. I pet and console her and was trying to figure out what she had heard, when I started to hear this huffing sound and then these weird ungodly calls from something just feet from the tent. After a few thuds on the ground outside, and some more calls, I start hearing something &lt;em&gt;mimicking the dog&amp;#39;s whine&lt;/em&gt; between the calls. I sat frozen for a bit, scared I was about to be skinned alive and eaten by some skinwalker, until I finally built up the courage to peak out the tent and see what it was. I slowly crept to the zipper, pulled it down as quietly as I could, peaked out, and I saw... A small group of deer were just chilling in our camp, taking turns drinking water from the river we were camped out next to! The mimicking was coming from a nearby Stellar&amp;#39;s Jay, and deer apparently just happen to sound like hungry bear demons when it&amp;#39;s 4 AM in the middle of nowhere. That&amp;#39;s how I learned that Jay&amp;#39;s will mimic sounds, and that my friend would probably sleep through the apocalypse given the chance.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t6gq1", "score_hidden": false, "stickied": false, "created": 1462436369.0, "author_flair_text": null, "created_utc": 1462407569.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t455a", "gilded": 0, "archived": false, "report_reasons": null, "author": "QuadrasaurusFlex", "parent_id": "t3_4hx1co", "score": 3, "approved_by": null, "controversiality": 0, "body": "I was out camping in the woods in Northeast PA with a few friends. As the night was winding down and the we were all getting ready to turn in, we started hearing little voices. \n\nWe called it \"Chittering\" because it...well that's the exact thing it sounded like. Not words but just chitter-y sounds. It sounded too whispy to be insects, and too irregular. \n\nNone of us could pin point where the sounds came from either. It just sounded like a conversation circling around us. \n\nMaybe from the terror, or whether he actually saw something, one of the guys said he saw \"knee high\" shadows on the edge of the campfire light flickering. \n\nIt abruptly stopped, but I couldn't tell you how long it actually went on. It felt like hours. We promptly got the fuck out of there in the morning. Haven't really felt like camping since haha", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was out camping in the woods in Northeast PA with a few friends. As the night was winding down and the we were all getting ready to turn in, we started hearing little voices. &lt;/p&gt;\n\n&lt;p&gt;We called it &amp;quot;Chittering&amp;quot; because it...well that&amp;#39;s the exact thing it sounded like. Not words but just chitter-y sounds. It sounded too whispy to be insects, and too irregular. &lt;/p&gt;\n\n&lt;p&gt;None of us could pin point where the sounds came from either. It just sounded like a conversation circling around us. &lt;/p&gt;\n\n&lt;p&gt;Maybe from the terror, or whether he actually saw something, one of the guys said he saw &amp;quot;knee high&amp;quot; shadows on the edge of the campfire light flickering. &lt;/p&gt;\n\n&lt;p&gt;It abruptly stopped, but I couldn&amp;#39;t tell you how long it actually went on. It felt like hours. We promptly got the fuck out of there in the morning. Haven&amp;#39;t really felt like camping since haha&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t455a", "score_hidden": false, "stickied": false, "created": 1462432744.0, "author_flair_text": null, "created_utc": 1462403944.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2tflud", "gilded": 0, "archived": false, "report_reasons": null, "author": "Take42", "parent_id": "t1_d2tahgo", "score": 2, "approved_by": null, "controversiality": 0, "body": "Oh man, that thread is one of my favorites! I can't imagine being in that person's situation, I'd probably just start breaking down.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh man, that thread is one of my favorites! I can&amp;#39;t imagine being in that person&amp;#39;s situation, I&amp;#39;d probably just start breaking down.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2tflud", "score_hidden": false, "stickied": false, "created": 1462451437.0, "author_flair_text": null, "created_utc": 1462422637.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2tahgo", "gilded": 0, "archived": false, "report_reasons": null, "author": "AnthillOmbudsman", "parent_id": "t3_4hx1co", "score": 3, "approved_by": null, "controversiality": 0, "body": "Not my story, but this is one that appeared on Reddit awhile back that I still remember: https://www.reddit.com/r/AskReddit/comments/3oj1b0/redditors_who_spend_a_lot_of_time_in_seclusion_at/cvxp7r9", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not my story, but this is one that appeared on Reddit awhile back that I still remember: &lt;a href=\"https://www.reddit.com/r/AskReddit/comments/3oj1b0/redditors_who_spend_a_lot_of_time_in_seclusion_at/cvxp7r9\"&gt;https://www.reddit.com/r/AskReddit/comments/3oj1b0/redditors_who_spend_a_lot_of_time_in_seclusion_at/cvxp7r9&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2tahgo", "score_hidden": false, "stickied": false, "created": 1462442392.0, "author_flair_text": null, "created_utc": 1462413592.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2tfmun", "gilded": 0, "archived": false, "report_reasons": null, "author": "Take42", "parent_id": "t1_d2tbazd", "score": 1, "approved_by": null, "controversiality": 0, "body": "Damn, nature.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Damn, nature.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2tfmun", "score_hidden": false, "stickied": false, "created": 1462451493.0, "author_flair_text": null, "created_utc": 1462422693.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2tbazd", "gilded": 0, "archived": false, "report_reasons": null, "author": "phasik", "parent_id": "t3_4hx1co", "score": 3, "approved_by": null, "controversiality": 0, "body": "I'll keep it short and sweet.\n\nMe and the ex GF decided on a whim to camp at some site she had heard of. Mind you, I have never been camping before. We get there, set everything up, have a little sexy time, and head to bed.\n\n6:30ish in the morning, we get woken up by some god awful growling sound. It was very low, drawn out and sounded like it was very VERY close to the tent. I was freaking out but remaining quiet. She whispered, \"It must be a gator\". She grew up in Louisiana so she was used to these types of sounds.\n\nI manned up, slowly unzipped the tent door and took a look see. Nothing in front of our tent. We both counted to 3, unlocked the car doors and made a run for it. Looked back and there was nothing around the tent. However, about ~30 feet away, there was a rustling in the thicket near the water. A 15 foot gator looked at us, turned around and slithered back into the water.\n\nHaven't been camping since.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll keep it short and sweet.&lt;/p&gt;\n\n&lt;p&gt;Me and the ex GF decided on a whim to camp at some site she had heard of. Mind you, I have never been camping before. We get there, set everything up, have a little sexy time, and head to bed.&lt;/p&gt;\n\n&lt;p&gt;6:30ish in the morning, we get woken up by some god awful growling sound. It was very low, drawn out and sounded like it was very VERY close to the tent. I was freaking out but remaining quiet. She whispered, &amp;quot;It must be a gator&amp;quot;. She grew up in Louisiana so she was used to these types of sounds.&lt;/p&gt;\n\n&lt;p&gt;I manned up, slowly unzipped the tent door and took a look see. Nothing in front of our tent. We both counted to 3, unlocked the car doors and made a run for it. Looked back and there was nothing around the tent. However, about ~30 feet away, there was a rustling in the thicket near the water. A 15 foot gator looked at us, turned around and slithered back into the water.&lt;/p&gt;\n\n&lt;p&gt;Haven&amp;#39;t been camping since.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2tbazd", "score_hidden": false, "stickied": false, "created": 1462443703.0, "author_flair_text": null, "created_utc": 1462414903.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2t3lhz", "gilded": 0, "archived": false, "report_reasons": null, "author": "bluecoop36", "parent_id": "t3_4hx1co", "score": 2, "approved_by": null, "controversiality": 0, "body": "Not super creepy, but this past Summer we had a wolf pack that was howling back and forth on either side of our trailer.  I wasn't super afraid, but I still opted to make my husband grab something from the SUV instead of going myself.  They were also exactly where my husband had been painting earlier that evening.  ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not super creepy, but this past Summer we had a wolf pack that was howling back and forth on either side of our trailer.  I wasn&amp;#39;t super afraid, but I still opted to make my husband grab something from the SUV instead of going myself.  They were also exactly where my husband had been painting earlier that evening.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t3lhz", "score_hidden": false, "stickied": false, "created": 1462431906.0, "author_flair_text": null, "created_utc": 1462403106.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2ys13i", "gilded": 0, "archived": false, "report_reasons": null, "author": "IWantAPuppyArmy", "parent_id": "t1_d2thksv", "score": 2, "approved_by": null, "controversiality": 0, "body": "I love these. Sent them to my husband a few months ago and he still brings them up all the time. Of course, he brings them up when we're in the outdoors somewhere...", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I love these. Sent them to my husband a few months ago and he still brings them up all the time. Of course, he brings them up when we&amp;#39;re in the outdoors somewhere...&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2ys13i", "score_hidden": false, "stickied": false, "created": 1462841750.0, "author_flair_text": null, "created_utc": 1462812950.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2thksv", "gilded": 0, "archived": false, "report_reasons": null, "author": "eskapizm5", "parent_id": "t3_4hx1co", "score": 2, "approved_by": null, "controversiality": 0, "body": "Not my stories (and I highly doubt that most of them are true), but if you're into that sort of thing than check out [this NoSleep series.](https://www.reddit.com/r/nosleep/comments/3iex1h/im_a_search_and_rescue_officer_for_the_us_forest/?) Someone recommended this to me a few months back and I've been re-reading it recently.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not my stories (and I highly doubt that most of them are true), but if you&amp;#39;re into that sort of thing than check out &lt;a href=\"https://www.reddit.com/r/nosleep/comments/3iex1h/im_a_search_and_rescue_officer_for_the_us_forest/?\"&gt;this NoSleep series.&lt;/a&gt; Someone recommended this to me a few months back and I&amp;#39;ve been re-reading it recently.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2thksv", "score_hidden": false, "stickied": false, "created": 1462456073.0, "author_flair_text": null, "created_utc": 1462427273.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2t4b3k", "gilded": 0, "archived": false, "report_reasons": null, "author": "thepizzapeople", "parent_id": "t1_d2t4aa7", "score": 2, "approved_by": null, "controversiality": 0, "body": "Dammit.....", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Dammit.....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t4b3k", "score_hidden": false, "stickied": false, "created": 1462432997.0, "author_flair_text": null, "created_utc": 1462404197.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t4aa7", "gilded": 0, "archived": false, "report_reasons": null, "author": "[deleted]", "parent_id": "t1_d2t3ux3", "score": 2, "approved_by": null, "controversiality": 0, "body": "[deleted]", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t4aa7", "score_hidden": false, "stickied": false, "created": 1462432961.0, "author_flair_text": null, "created_utc": 1462404161.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t3ux3", "gilded": 0, "archived": false, "report_reasons": null, "author": "thepizzapeople", "parent_id": "t3_4hx1co", "score": 3, "approved_by": null, "controversiality": 0, "body": "I've found that if you act nervous and convincingly pretend to see and here things, people who aren't comfortable in the wilderness will start seeing and hearing a TON of shit. There's nothing there, nothing at all. Power of suggestion, human psyche, etc etc. Take anything you here with a grain of salt. \n\nThe human mind is capable of scaring the shit out of itself.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve found that if you act nervous and convincingly pretend to see and here things, people who aren&amp;#39;t comfortable in the wilderness will start seeing and hearing a TON of shit. There&amp;#39;s nothing there, nothing at all. Power of suggestion, human psyche, etc etc. Take anything you here with a grain of salt. &lt;/p&gt;\n\n&lt;p&gt;The human mind is capable of scaring the shit out of itself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t3ux3", "score_hidden": false, "stickied": false, "created": 1462432305.0, "author_flair_text": null, "created_utc": 1462403505.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2t8k1t", "gilded": 0, "archived": false, "report_reasons": null, "author": "Eelz100", "parent_id": "t1_d2t6uwt", "score": 1, "approved_by": null, "controversiality": 0, "body": "I wouldn't be able to bear him. \n\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t be able to bear him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t8k1t", "score_hidden": false, "stickied": false, "created": 1462439426.0, "author_flair_text": null, "created_utc": 1462410626.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t6uwt", "gilded": 0, "archived": false, "report_reasons": null, "author": "Archmage_Falagar", "parent_id": "t1_d2t6tqt", "score": 2, "approved_by": null, "controversiality": 0, "body": "That's probably true.  He was a bear of a man.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s probably true.  He was a bear of a man.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t6uwt", "score_hidden": false, "stickied": false, "created": 1462436958.0, "author_flair_text": null, "created_utc": 1462408158.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t6tqt", "gilded": 0, "archived": false, "report_reasons": null, "author": "Take42", "parent_id": "t1_d2t5g46", "score": 4, "approved_by": null, "controversiality": 0, "body": "Plot twist, your dad was a bear the whole time.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Plot twist, your dad was a bear the whole time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t6tqt", "score_hidden": false, "stickied": false, "created": 1462436912.0, "author_flair_text": null, "created_utc": 1462408112.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 4}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t5g46", "gilded": 0, "archived": false, "report_reasons": null, "author": "Archmage_Falagar", "parent_id": "t3_4hx1co", "score": 3, "approved_by": null, "controversiality": 0, "body": "My family was out camping when I was very young on the ~600 acres of land in the family.  We were warned about a few things, like the badger that lived in the old outhouse and to be wary of shaking trees, because that's what bears did.\n\nMy father sent me and my brother out exploring, and we had walked for awhile down a trail when one of the nearby trails, covered in brush and overgrown weeds, started shaking furiously and grunting.  We of course screamed and ran all the way back to our campsite.\n\nFound out later that was just our dad.  Apparently bears really do shake trees though.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My family was out camping when I was very young on the ~600 acres of land in the family.  We were warned about a few things, like the badger that lived in the old outhouse and to be wary of shaking trees, because that&amp;#39;s what bears did.&lt;/p&gt;\n\n&lt;p&gt;My father sent me and my brother out exploring, and we had walked for awhile down a trail when one of the nearby trails, covered in brush and overgrown weeds, started shaking furiously and grunting.  We of course screamed and ran all the way back to our campsite.&lt;/p&gt;\n\n&lt;p&gt;Found out later that was just our dad.  Apparently bears really do shake trees though.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t5g46", "score_hidden": false, "stickied": false, "created": 1462434800.0, "author_flair_text": null, "created_utc": 1462406000.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2t6kx1", "gilded": 0, "archived": false, "report_reasons": null, "author": "Take42", "parent_id": "t1_d2t2w02", "score": 1, "approved_by": null, "controversiality": 0, "body": "By far one of the creepiest parts of camping is when you are the last one awake, getting tired, and your mind plays tricks on you as the fire begins to dim and cast dancing shadows across the trees.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;By far one of the creepiest parts of camping is when you are the last one awake, getting tired, and your mind plays tricks on you as the fire begins to dim and cast dancing shadows across the trees.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t6kx1", "score_hidden": false, "stickied": false, "created": 1462436548.0, "author_flair_text": null, "created_utc": 1462407748.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d2t2w02", "gilded": 0, "archived": false, "report_reasons": null, "author": "IamEclipse", "parent_id": "t3_4hx1co", "score": 2, "approved_by": null, "controversiality": 0, "body": "I see a lot of shadow figures at night out there, they creep me out more than anything.\n\nYou also hear things that aren't there", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see a lot of shadow figures at night out there, they creep me out more than anything.&lt;/p&gt;\n\n&lt;p&gt;You also hear things that aren&amp;#39;t there&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t2w02", "score_hidden": false, "stickied": false, "created": 1462430851.0, "author_flair_text": null, "created_utc": 1462402051.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4hx1co", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d2t3pkw", "gilded": 0, "archived": false, "report_reasons": null, "author": "Karma_y0", "parent_id": "t3_4hx1co", "score": 1, "approved_by": null, "controversiality": 0, "body": "I haven't back packed but at camp I went too we were right near the hermit of Maine..", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t back packed but at camp I went too we were right near the hermit of Maine..&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d2t3pkw", "score_hidden": false, "stickied": false, "created": 1462432073.0, "author_flair_text": null, "created_utc": 1462403273.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}]