[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.AskReddit", "banned_by": null, "media_embed": {}, "subreddit": "AskReddit", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "48zl8i", "from_kind": null, "gilded": 0, "archived": false, "clicked": false, "report_reasons": null, "author": "_BallsDeep69_", "media": null, "name": "t3_48zl8i", "score": 3, "approved_by": null, "over_18": true, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh1i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "mod_reports": [], "secure_media_embed": {}, "saved": false, "removal_reason": null, "stickied": false, "from": null, "is_self": true, "from_id": null, "permalink": "/r/AskReddit/comments/48zl8i/what_is_the_worst_way_youve_been_harassed/", "locked": false, "hide_score": false, "created": 1457158118.0, "url": "https://www.reddit.com/r/AskReddit/comments/48zl8i/what_is_the_worst_way_youve_been_harassed/", "author_flair_text": null, "quarantine": false, "title": "What is the worst way you've been harassed?", "created_utc": 1457129318.0, "ups": 3, "upvote_ratio": 0.72, "num_comments": 4, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_48zl8i", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_48zl8i", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d0nwdhb", "gilded": 0, "archived": false, "report_reasons": null, "author": "v0rtex-", "parent_id": "t1_d0nw09x", "score": 3, "approved_by": null, "controversiality": 0, "body": "We call those nunchucks.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We call those nunchucks.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d0nwdhb", "score_hidden": false, "stickied": false, "created": 1457159425.0, "author_flair_text": null, "created_utc": 1457130625.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d0nw09x", "gilded": 0, "archived": false, "report_reasons": null, "author": "Aromastotle", "parent_id": "t3_48zl8i", "score": 2, "approved_by": null, "controversiality": 0, "body": "My dad beat the fuck out of me with jumper cables", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My dad beat the fuck out of me with jumper cables&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d0nw09x", "score_hidden": false, "stickied": false, "created": 1457158858.0, "author_flair_text": null, "created_utc": 1457130058.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_48zl8i", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d0nyq4k", "gilded": 0, "archived": false, "report_reasons": null, "author": "sofiagia", "parent_id": "t3_48zl8i", "score": 2, "approved_by": null, "controversiality": 0, "body": "When I was 18, I went to my cell phone service provider's store to ask about changing my contract. My mom, who's a contract lawyer and hates phone companies, came with me to look over the contract and whatnot. We went in pretty close to closing and starting talking about my new contract. My mom read the 10 page contract thoroughly and asked the guy helping us to reprint it because it was missing a page. Needless to say, it took a long time and both the employee and I were getting annoyed. Then I get a text, so I look down at my phone and see message from a number I don't know saying \"sorry this is taking so long ;) I really want to get out of here\". It took me a second to realize that the guy helping us had taken my number from the system he was using to help me with my contract and texted me on his personal phone. I did not give him my number for him to have it and text me, I gave him my number so that he could do his job and help me with my contract. I've never been so flabbergasted by someone's inappropriateness and unprofessional behaviour.   ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I was 18, I went to my cell phone service provider&amp;#39;s store to ask about changing my contract. My mom, who&amp;#39;s a contract lawyer and hates phone companies, came with me to look over the contract and whatnot. We went in pretty close to closing and starting talking about my new contract. My mom read the 10 page contract thoroughly and asked the guy helping us to reprint it because it was missing a page. Needless to say, it took a long time and both the employee and I were getting annoyed. Then I get a text, so I look down at my phone and see message from a number I don&amp;#39;t know saying &amp;quot;sorry this is taking so long ;) I really want to get out of here&amp;quot;. It took me a second to realize that the guy helping us had taken my number from the system he was using to help me with my contract and texted me on his personal phone. I did not give him my number for him to have it and text me, I gave him my number so that he could do his job and help me with my contract. I&amp;#39;ve never been so flabbergasted by someone&amp;#39;s inappropriateness and unprofessional behaviour.   &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d0nyq4k", "score_hidden": false, "stickied": false, "created": 1457163214.0, "author_flair_text": null, "created_utc": 1457134414.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_48zl8i", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d0nzikq", "gilded": 0, "archived": false, "report_reasons": null, "author": "jaysjami", "parent_id": "t3_48zl8i", "score": 2, "approved_by": null, "controversiality": 0, "body": "I have a group of umm.. fans.. who used to be friends over a decade ago. They turned on me when I stood up for someone they targeted. When you're one of the wolves and the pack turns on you, you know what's coming at least. And they've attacked me in various ways repeatedly for years. It's been over 11 years since they turned on me and every time I think they've probably let shit go and forgotten about me, they pop up and let me know they're still around. It's hard to explain their kind of harassment though. I used to be one of them. So I know how vicious they can be and they are brutal when they want to go after someone. I don't dwell on it often. When they pop up though it causes me some anxiety. I know they're watching certain aspects of my life the past year and I'm just kind of waiting for the shoe to drop to see how they're going to fuck with me.  They like to find very personal ways to harm people.. seek out and watch their friends, relationships, and family members and then when they think they have something that can harm that connection for the person they'r targeting, they release it to the person you're close to and sit back and watch for whatever destruction and pain they can cause the target. It's like adult \"mean girls\" to an extreme. For all I know they follow this account. I already know they follow me on other social media.  I've kind of adopted the attitude that they can only hurt me if I let them. The only thing I worry about at this point is them hurting people I care about. Which.. they know is how to best hurt me. I regret ever befriending them when I did. I don't regret my actions that caused them to turn on me, I did the right thing. I just wish they'd forget about me. \n\nI have another group of haters as well.. who were people from different areas of my life who one person who hated me gathered together a few years ago. It's like a little coalition of my haters, they made a \"secret\" facebook group just to talk shit on me. Funny how things like that never stay secret for long.. one person will always leak it. I don't worry about them.. they can hate away. \n\nI'm not sure why I attract so many haters and why I have actual \"fan clubs\" of people wanting to talk shit about me or harm me. But I do. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a group of umm.. fans.. who used to be friends over a decade ago. They turned on me when I stood up for someone they targeted. When you&amp;#39;re one of the wolves and the pack turns on you, you know what&amp;#39;s coming at least. And they&amp;#39;ve attacked me in various ways repeatedly for years. It&amp;#39;s been over 11 years since they turned on me and every time I think they&amp;#39;ve probably let shit go and forgotten about me, they pop up and let me know they&amp;#39;re still around. It&amp;#39;s hard to explain their kind of harassment though. I used to be one of them. So I know how vicious they can be and they are brutal when they want to go after someone. I don&amp;#39;t dwell on it often. When they pop up though it causes me some anxiety. I know they&amp;#39;re watching certain aspects of my life the past year and I&amp;#39;m just kind of waiting for the shoe to drop to see how they&amp;#39;re going to fuck with me.  They like to find very personal ways to harm people.. seek out and watch their friends, relationships, and family members and then when they think they have something that can harm that connection for the person they&amp;#39;r targeting, they release it to the person you&amp;#39;re close to and sit back and watch for whatever destruction and pain they can cause the target. It&amp;#39;s like adult &amp;quot;mean girls&amp;quot; to an extreme. For all I know they follow this account. I already know they follow me on other social media.  I&amp;#39;ve kind of adopted the attitude that they can only hurt me if I let them. The only thing I worry about at this point is them hurting people I care about. Which.. they know is how to best hurt me. I regret ever befriending them when I did. I don&amp;#39;t regret my actions that caused them to turn on me, I did the right thing. I just wish they&amp;#39;d forget about me. &lt;/p&gt;\n\n&lt;p&gt;I have another group of haters as well.. who were people from different areas of my life who one person who hated me gathered together a few years ago. It&amp;#39;s like a little coalition of my haters, they made a &amp;quot;secret&amp;quot; facebook group just to talk shit on me. Funny how things like that never stay secret for long.. one person will always leak it. I don&amp;#39;t worry about them.. they can hate away. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure why I attract so many haters and why I have actual &amp;quot;fan clubs&amp;quot; of people wanting to talk shit about me or harm me. But I do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d0nzikq", "score_hidden": false, "stickied": false, "created": 1457164547.0, "author_flair_text": null, "created_utc": 1457135747.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}], "after": null, "before": null}}]