[{"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t3", "data": {"domain": "self.AskReddit", "banned_by": null, "media_embed": {}, "subreddit": "AskReddit", "selftext_html": null, "selftext": "", "likes": null, "suggested_sort": null, "user_reports": [], "secure_media": null, "link_flair_text": null, "id": "4jjh7m", "from_kind": null, "gilded": 0, "archived": false, "clicked": false, "report_reasons": null, "author": "mav194", "media": null, "name": "t3_4jjh7m", "score": 50, "approved_by": null, "over_18": false, "hidden": false, "thumbnail": "", "subreddit_id": "t5_2qh1i", "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "downs": 0, "mod_reports": [], "secure_media_embed": {}, "saved": false, "removal_reason": null, "stickied": false, "from": null, "is_self": true, "from_id": null, "permalink": "/r/AskReddit/comments/4jjh7m/whats_your_story_youve_always_wanted_to_tell_on/", "locked": false, "hide_score": false, "created": 1463399148.0, "url": "https://www.reddit.com/r/AskReddit/comments/4jjh7m/whats_your_story_youve_always_wanted_to_tell_on/", "author_flair_text": null, "quarantine": false, "title": "What's your story you've always wanted to tell on reddit, but the appropriate question/thread never came up?", "created_utc": 1463370348.0, "ups": 50, "upvote_ratio": 0.8, "num_comments": 39, "visited": false, "num_reports": null, "distinguished": null}}], "after": null, "before": null}}, {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d375eeb", "gilded": 0, "archived": false, "report_reasons": null, "author": "ps4gamedemon", "parent_id": "t1_d374dfl", "score": 5, "approved_by": null, "controversiality": 0, "body": "this really made me smile !! chris sounds like a true best friend and so do you :) ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;this really made me smile !! chris sounds like a true best friend and so do you :) &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d375eeb", "score_hidden": false, "stickied": false, "created": 1463402377.0, "author_flair_text": null, "created_utc": 1463373577.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 5}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d39o8x3", "gilded": 0, "archived": false, "report_reasons": null, "author": "MilkMakesMePoop", "parent_id": "t1_d379qbn", "score": 2, "approved_by": null, "controversiality": 0, "body": "I made the speech, actually. I practiced it in my head from time to time over the course of two months without ever writing anything down. If I had said everything I'd practiced, it would have been a 40 minute speech. \n\nPracticing it mentally over the course of a long time meant that I would usually only remember the bits i liked best from the last practice. That way only the best of the best would make it to the final speech. I wanted to keep that extemporaneous feeling about the speech too, so on the day I had a list of four or five bullet points each with just a few words to jog my memory if necessary. The strategy worked well, but one side effect is that I couldn't tell you exactly what was said now a year later. \n\nI remember the first two bullet points though. Number 1 was \"common law.\" I made a cute joke about how Chris and I lived together long enough to be considered common law married in some more progressive states, so I really am not sure this whole ceremony is a sham or not. It was funnier than that, but that was the joke. The second bullet point was \"pizza.\" I said something about how there's not a person who meets Chris that doesn't immediately like him. He's like pizza or Tom Hanks - if you don't love it, there's something wrong with you. Again, the wording was better. Then that transitioned into the heartfelt, tear-jerker part. I looked at the bride and said something like, \"you know, some people spend their entire lives looking for their perfect soul mate. (Pause) but I was lucky enough to meet Chris in 9th grade.\" Awws followed by laughter. Then I said something like, \"they say you can be judged by the company you keep. That's how I like to judge myself, because (looking at the groom) the company I keep is the sort to always be there for you, to give without asking, to laugh when you laugh, and to commiserate when life takes away the laughter. These are some of the things that have made Chris a great friend. And these same things will make him a great husband. Ashley, if you have any inkling of the future you have in store for you as the love of Chris's life, then this must truly be the best day of yours (so far). Having gotten to know you over the past two years, i can say that there is not any better person for Chris. So, I'm happy to put my common law marriage rights aside and pass the reigns onto you. Let's all toast the beautiful couple and the lifetime of unfathomable happiness that lay before them!\" \n\nThe actual wording was better than this and im probably forgetting bits of it, but that was the gist. The way I prepared for it made the listener feel like I may not have prepared for it at all. It was short enough that it kept everyone's attention. It was funny enough to take the edge off the sappiness which made the sappy parts seem more honest. And the sappy bits were truly how I felt. \n\nChris's mom died suddenly two weeks ago. I saw a lot of his extended family that i hadn't really ever met except at the wedding. They all said they remembered me from my speech though. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I made the speech, actually. I practiced it in my head from time to time over the course of two months without ever writing anything down. If I had said everything I&amp;#39;d practiced, it would have been a 40 minute speech. &lt;/p&gt;\n\n&lt;p&gt;Practicing it mentally over the course of a long time meant that I would usually only remember the bits i liked best from the last practice. That way only the best of the best would make it to the final speech. I wanted to keep that extemporaneous feeling about the speech too, so on the day I had a list of four or five bullet points each with just a few words to jog my memory if necessary. The strategy worked well, but one side effect is that I couldn&amp;#39;t tell you exactly what was said now a year later. &lt;/p&gt;\n\n&lt;p&gt;I remember the first two bullet points though. Number 1 was &amp;quot;common law.&amp;quot; I made a cute joke about how Chris and I lived together long enough to be considered common law married in some more progressive states, so I really am not sure this whole ceremony is a sham or not. It was funnier than that, but that was the joke. The second bullet point was &amp;quot;pizza.&amp;quot; I said something about how there&amp;#39;s not a person who meets Chris that doesn&amp;#39;t immediately like him. He&amp;#39;s like pizza or Tom Hanks - if you don&amp;#39;t love it, there&amp;#39;s something wrong with you. Again, the wording was better. Then that transitioned into the heartfelt, tear-jerker part. I looked at the bride and said something like, &amp;quot;you know, some people spend their entire lives looking for their perfect soul mate. (Pause) but I was lucky enough to meet Chris in 9th grade.&amp;quot; Awws followed by laughter. Then I said something like, &amp;quot;they say you can be judged by the company you keep. That&amp;#39;s how I like to judge myself, because (looking at the groom) the company I keep is the sort to always be there for you, to give without asking, to laugh when you laugh, and to commiserate when life takes away the laughter. These are some of the things that have made Chris a great friend. And these same things will make him a great husband. Ashley, if you have any inkling of the future you have in store for you as the love of Chris&amp;#39;s life, then this must truly be the best day of yours (so far). Having gotten to know you over the past two years, i can say that there is not any better person for Chris. So, I&amp;#39;m happy to put my common law marriage rights aside and pass the reigns onto you. Let&amp;#39;s all toast the beautiful couple and the lifetime of unfathomable happiness that lay before them!&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;The actual wording was better than this and im probably forgetting bits of it, but that was the gist. The way I prepared for it made the listener feel like I may not have prepared for it at all. It was short enough that it kept everyone&amp;#39;s attention. It was funny enough to take the edge off the sappiness which made the sappy parts seem more honest. And the sappy bits were truly how I felt. &lt;/p&gt;\n\n&lt;p&gt;Chris&amp;#39;s mom died suddenly two weeks ago. I saw a lot of his extended family that i hadn&amp;#39;t really ever met except at the wedding. They all said they remembered me from my speech though. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d39o8x3", "score_hidden": false, "stickied": false, "created": 1463565200.0, "author_flair_text": null, "created_utc": 1463536400.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d379qbn", "gilded": 0, "archived": false, "report_reasons": null, "author": "victoryohone", "parent_id": "t1_d374dfl", "score": 4, "approved_by": null, "controversiality": 0, "body": "What did he say in the speech?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What did he say in the speech?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d379qbn", "score_hidden": false, "stickied": false, "created": 1463415171.0, "author_flair_text": null, "created_utc": 1463386371.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d37btmp", "gilded": 0, "archived": false, "report_reasons": null, "author": "IWantAnAffliction", "parent_id": "t1_d374dfl", "score": 1, "approved_by": null, "controversiality": 0, "body": "That's an incredible story, /u/MilkMakesMePoop", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s an incredible story, &lt;a href=\"/u/MilkMakesMePoop\"&gt;/u/MilkMakesMePoop&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37btmp", "score_hidden": false, "stickied": false, "created": 1463423358.0, "author_flair_text": null, "created_utc": 1463394558.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d374dfl", "gilded": 0, "archived": false, "report_reasons": null, "author": "MilkMakesMePoop", "parent_id": "t3_4jjh7m", "score": 32, "approved_by": null, "controversiality": 0, "body": "So 9th grade, I met my best friend. I'm 31 and he's my best friend still. He was a chubby dork. I was a no-friend nothing. I had recently been expelled from catholic school and didn't have a friend in the world. Everybody liked Chris, but nobody gave him credit for how awesome he really was. Then we met. He thought I was an insane goofball. I thought he was the genuine article. We were both right. \n\nChris came over to my house and got drunk for the first time playing the Big Lebowski drinking game with me and my baby sister (also insane). Years passed and our friendship became unassailable. The fucker literally bailed me out of jail and I gave a 90 second speech at his wedding that made 90% of the female attendees cry. \n\nIn 10th grade Chris got caught drinking. I supplied the booze because I knew how to make fake IDs. To keep me out of it, Chris told his parents that he bought a 40 from a bum at the local Krystal and that I shook my head in disapproval as he drank it. THATS FUCKING FRIENDSHIP!!! He took made himself look like a shithead to spare his parents opinion of me. I've spent my life trying to be such a friend to him. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So 9th grade, I met my best friend. I&amp;#39;m 31 and he&amp;#39;s my best friend still. He was a chubby dork. I was a no-friend nothing. I had recently been expelled from catholic school and didn&amp;#39;t have a friend in the world. Everybody liked Chris, but nobody gave him credit for how awesome he really was. Then we met. He thought I was an insane goofball. I thought he was the genuine article. We were both right. &lt;/p&gt;\n\n&lt;p&gt;Chris came over to my house and got drunk for the first time playing the Big Lebowski drinking game with me and my baby sister (also insane). Years passed and our friendship became unassailable. The fucker literally bailed me out of jail and I gave a 90 second speech at his wedding that made 90% of the female attendees cry. &lt;/p&gt;\n\n&lt;p&gt;In 10th grade Chris got caught drinking. I supplied the booze because I knew how to make fake IDs. To keep me out of it, Chris told his parents that he bought a 40 from a bum at the local Krystal and that I shook my head in disapproval as he drank it. THATS FUCKING FRIENDSHIP!!! He took made himself look like a shithead to spare his parents opinion of me. I&amp;#39;ve spent my life trying to be such a friend to him. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d374dfl", "score_hidden": false, "stickied": false, "created": 1463400153.0, "author_flair_text": null, "created_utc": 1463371353.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 32}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d379aoh", "gilded": 0, "archived": false, "report_reasons": null, "author": "kreynlan", "parent_id": "t1_d377twg", "score": 3, "approved_by": null, "controversiality": 0, "body": "I've been reading threads all night about crazy stuff like \"have you ever killed in self defense?\" and generally painful stories like that, but yours hit me harder than anything I've read on this site. I've always been alone and isolated myself from those around me, but my biggest fear is dying alone.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been reading threads all night about crazy stuff like &amp;quot;have you ever killed in self defense?&amp;quot; and generally painful stories like that, but yours hit me harder than anything I&amp;#39;ve read on this site. I&amp;#39;ve always been alone and isolated myself from those around me, but my biggest fear is dying alone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d379aoh", "score_hidden": false, "stickied": false, "created": 1463413539.0, "author_flair_text": null, "created_utc": 1463384739.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d37bv86", "gilded": 0, "archived": false, "report_reasons": null, "author": "IWantAnAffliction", "parent_id": "t1_d377twg", "score": 1, "approved_by": null, "controversiality": 0, "body": "Why don't you try volunteering or something? It won't change what happened, but there are definitely other people who could use help, and you could use it as a way to balance out what you feel guilty about, while achieving something good.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why don&amp;#39;t you try volunteering or something? It won&amp;#39;t change what happened, but there are definitely other people who could use help, and you could use it as a way to balance out what you feel guilty about, while achieving something good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37bv86", "score_hidden": false, "stickied": false, "created": 1463423516.0, "author_flair_text": null, "created_utc": 1463394716.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d377twg", "gilded": 0, "archived": false, "report_reasons": null, "author": "workingclazero", "parent_id": "t3_4jjh7m", "score": 13, "approved_by": null, "controversiality": 0, "body": "So sorry to be a downer.\n \nIn the late 90’s I was living in my first apartment in Pittsburgh’s North Side. I finally had work that paid more than survival, my girl lived with me, life was sweet. I was free. I was finally an adult.\n\nIn my free time when my girl was at classes I would sit on the stoop and have a drink. My upstairs neighbor would also hangout and smoke &amp; drink with me. He was that kind of ghetto white boy, that spoke ‘street’ , grew up impoverished, was uneducated to the point of seeming stupid but was not. He was wholly naive to a wider world due to never having been outside of a handful of neighborhoods of greater Pittsburgh. \n\nHe told me he liked talking to me as I was “smart” and “good people”. I think that was due to me having some measure of upward mobility. It seemed crazy to me that although I grew up quite poor, here was someone to whom I represented the pinnacle of refinement and class status.\n\nAfter hanging out and drinking together it comes out that he is HIV+.  He claims he was taken advantage of by an older man when he was 15 or 16. He is adamantly anti-gay, says gays are predators, on and on. I think he was either in denial or had sold himself, regardless I didn’t feel any judgement to anything he said. He had been disowned by all of his family and friends as an abomination, for having the “bug”. Me and his caseworker were all the only people he had in this world. \n\nAs time went by he became more and more gaunt. One week he disappears, no word. When he shows up again he says he was taken to the hospital. He had collapsed on his floor on the way to the bathroom and didn’t have the strength to get up to the phone. He was on the floor for about 12 hours and shit &amp; pissed himself, his caseworker had found him. He was scared. He knew the end was going to be before long. The closest hospice he could go to was on the other side of town, he didn’t want to be isolated and would I come see him? \n\nOne week later he calls me in the evening from his facility, he is not doing well, the end is soon, he doesn’t want to be alone and would I come see him? I tell him not right then but the next day. The next day comes and I didn’t go. I never heard from him again. He most likely died the day he called me or the next. I will never know. \n\nI knew it was wrong at the time. I can’t rightly explain why I didn’t. I tried explaining to myself that it had been too much to handle and I hide from it, but that’s just post-hoc rationalization. The only thing that could be said for sure is that I put my convenience ahead of another person’s needs. I let a terrified human die alone without the love needed. A person that had been given nothing but pain in life and had been betrayed by everyone in his life, had been at his death, betrayed yet again by me.\n\nI have never told anyone in full about this simply because I do not know how to convey it. I want no one to think I am looking for pity or absolution. I just had to tell it somehow to someone. It gnaws at me, makes me physically cringe and nauseous any time I think of it. I don’t want or think I should be free from the guilt. I think for something like this you should have to bear that for the rest of your life. Some sins must be suffered for.\n\nI write about how I feel rather than how he must have felt. Even now it gets made about me. And I can’t even remember his name. \nFuck.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So sorry to be a downer.&lt;/p&gt;\n\n&lt;p&gt;In the late 90’s I was living in my first apartment in Pittsburgh’s North Side. I finally had work that paid more than survival, my girl lived with me, life was sweet. I was free. I was finally an adult.&lt;/p&gt;\n\n&lt;p&gt;In my free time when my girl was at classes I would sit on the stoop and have a drink. My upstairs neighbor would also hangout and smoke &amp;amp; drink with me. He was that kind of ghetto white boy, that spoke ‘street’ , grew up impoverished, was uneducated to the point of seeming stupid but was not. He was wholly naive to a wider world due to never having been outside of a handful of neighborhoods of greater Pittsburgh. &lt;/p&gt;\n\n&lt;p&gt;He told me he liked talking to me as I was “smart” and “good people”. I think that was due to me having some measure of upward mobility. It seemed crazy to me that although I grew up quite poor, here was someone to whom I represented the pinnacle of refinement and class status.&lt;/p&gt;\n\n&lt;p&gt;After hanging out and drinking together it comes out that he is HIV+.  He claims he was taken advantage of by an older man when he was 15 or 16. He is adamantly anti-gay, says gays are predators, on and on. I think he was either in denial or had sold himself, regardless I didn’t feel any judgement to anything he said. He had been disowned by all of his family and friends as an abomination, for having the “bug”. Me and his caseworker were all the only people he had in this world. &lt;/p&gt;\n\n&lt;p&gt;As time went by he became more and more gaunt. One week he disappears, no word. When he shows up again he says he was taken to the hospital. He had collapsed on his floor on the way to the bathroom and didn’t have the strength to get up to the phone. He was on the floor for about 12 hours and shit &amp;amp; pissed himself, his caseworker had found him. He was scared. He knew the end was going to be before long. The closest hospice he could go to was on the other side of town, he didn’t want to be isolated and would I come see him? &lt;/p&gt;\n\n&lt;p&gt;One week later he calls me in the evening from his facility, he is not doing well, the end is soon, he doesn’t want to be alone and would I come see him? I tell him not right then but the next day. The next day comes and I didn’t go. I never heard from him again. He most likely died the day he called me or the next. I will never know. &lt;/p&gt;\n\n&lt;p&gt;I knew it was wrong at the time. I can’t rightly explain why I didn’t. I tried explaining to myself that it had been too much to handle and I hide from it, but that’s just post-hoc rationalization. The only thing that could be said for sure is that I put my convenience ahead of another person’s needs. I let a terrified human die alone without the love needed. A person that had been given nothing but pain in life and had been betrayed by everyone in his life, had been at his death, betrayed yet again by me.&lt;/p&gt;\n\n&lt;p&gt;I have never told anyone in full about this simply because I do not know how to convey it. I want no one to think I am looking for pity or absolution. I just had to tell it somehow to someone. It gnaws at me, makes me physically cringe and nauseous any time I think of it. I don’t want or think I should be free from the guilt. I think for something like this you should have to bear that for the rest of your life. Some sins must be suffered for.&lt;/p&gt;\n\n&lt;p&gt;I write about how I feel rather than how he must have felt. Even now it gets made about me. And I can’t even remember his name. \nFuck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d377twg", "score_hidden": false, "stickied": false, "created": 1463408688.0, "author_flair_text": null, "created_utc": 1463379888.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 13}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d37bz3k", "gilded": 0, "archived": false, "report_reasons": null, "author": "IWantAnAffliction", "parent_id": "t1_d376alq", "score": 2, "approved_by": null, "controversiality": 0, "body": "It doesn't happen to me every time, but I'm also a sympathy-crier. I basically never cry of my own accord.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It doesn&amp;#39;t happen to me every time, but I&amp;#39;m also a sympathy-crier. I basically never cry of my own accord.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37bz3k", "score_hidden": false, "stickied": false, "created": 1463423893.0, "author_flair_text": null, "created_utc": 1463395093.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d376alq", "gilded": 0, "archived": false, "report_reasons": null, "author": "jeff_the_nurse", "parent_id": "t3_4jjh7m", "score": 9, "approved_by": null, "controversiality": 0, "body": "I always cry with my wife so she doesn't have to alone.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I always cry with my wife so she doesn&amp;#39;t have to alone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d376alq", "score_hidden": false, "stickied": false, "created": 1463404493.0, "author_flair_text": null, "created_utc": 1463375693.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 9}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d377i9l", "gilded": 0, "archived": false, "report_reasons": null, "author": "hilroy246", "parent_id": "t1_d37714m", "score": 1, "approved_by": null, "controversiality": 0, "body": "Of course, I didn't mean right away. I'm looking forward to it even if nothing happens. Just curious :)", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of course, I didn&amp;#39;t mean right away. I&amp;#39;m looking forward to it even if nothing happens. Just curious :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d377i9l", "score_hidden": false, "stickied": false, "created": 1463407736.0, "author_flair_text": null, "created_utc": 1463378936.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d37g29c", "gilded": 0, "archived": false, "report_reasons": null, "author": "twofeetcia", "parent_id": "t1_d37714m", "score": 1, "approved_by": null, "controversiality": 0, "body": "/u/remindmebot 1week!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"/u/remindmebot\"&gt;/u/remindmebot&lt;/a&gt; 1week!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37g29c", "score_hidden": false, "stickied": false, "created": 1463434384.0, "author_flair_text": null, "created_utc": 1463405584.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d37714m", "gilded": 0, "archived": false, "report_reasons": null, "author": "mmcrunchie", "parent_id": "t1_d376xt2", "score": 5, "approved_by": null, "controversiality": 0, "body": "Give me 120 hours. I get paid Fridays. It's Monday, 3:45PM.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Give me 120 hours. I get paid Fridays. It&amp;#39;s Monday, 3:45PM.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37714m", "score_hidden": false, "stickied": false, "created": 1463406393.0, "author_flair_text": null, "created_utc": 1463377593.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 5}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d376xt2", "gilded": 0, "archived": false, "report_reasons": null, "author": "hilroy246", "parent_id": "t1_d376g5w", "score": 1, "approved_by": null, "controversiality": 0, "body": "I'd like an update, please.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d like an update, please.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d376xt2", "score_hidden": false, "stickied": false, "created": 1463406142.0, "author_flair_text": null, "created_utc": 1463377342.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d376g5w", "gilded": 0, "archived": false, "report_reasons": null, "author": "mmcrunchie", "parent_id": "t3_4jjh7m", "score": 11, "approved_by": null, "controversiality": 0, "body": "I get paid in cheque, so I have to go all the way up to the bank during my lunch break every second Friday to cash it straight into my bank account. I've been working here two years. The people at the bank know me. The last time I was there, the teller said to me \"Why don't they just direct deposit?\" and my response was \"My other boss is old. He likes it this way instead of the better way.\"  \n\nMy boss went up to the bank last week, saying he'd be \"right back\". He disappeared for a solid 35 minutes. He came back and said \"I just got lectured by the teller for not paying you via direct deposit.\" It's not even this boss' fault. I absolutely lost my shit and couldn't stop laughing.  \n\nIt's pay week again. It's gonna be fun if I get the same teller again.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I get paid in cheque, so I have to go all the way up to the bank during my lunch break every second Friday to cash it straight into my bank account. I&amp;#39;ve been working here two years. The people at the bank know me. The last time I was there, the teller said to me &amp;quot;Why don&amp;#39;t they just direct deposit?&amp;quot; and my response was &amp;quot;My other boss is old. He likes it this way instead of the better way.&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;My boss went up to the bank last week, saying he&amp;#39;d be &amp;quot;right back&amp;quot;. He disappeared for a solid 35 minutes. He came back and said &amp;quot;I just got lectured by the teller for not paying you via direct deposit.&amp;quot; It&amp;#39;s not even this boss&amp;#39; fault. I absolutely lost my shit and couldn&amp;#39;t stop laughing.  &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s pay week again. It&amp;#39;s gonna be fun if I get the same teller again.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d376g5w", "score_hidden": false, "stickied": false, "created": 1463404872.0, "author_flair_text": null, "created_utc": 1463376072.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 11}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d379bv7", "gilded": 0, "archived": false, "report_reasons": null, "author": "kreynlan", "parent_id": "t1_d378637", "score": 8, "approved_by": null, "controversiality": 0, "body": "You sucked the luck out of the manatee to fulfill your wish. \n\n\nI hope you're happy.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You sucked the luck out of the manatee to fulfill your wish. &lt;/p&gt;\n\n&lt;p&gt;I hope you&amp;#39;re happy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d379bv7", "score_hidden": false, "stickied": false, "created": 1463413660.0, "author_flair_text": null, "created_utc": 1463384860.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d37bsam", "gilded": 0, "archived": false, "report_reasons": null, "author": "bradford99", "parent_id": "t1_d378637", "score": 2, "approved_by": null, "controversiality": 0, "body": "That is so hilariously traumatic. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is so hilariously traumatic. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37bsam", "score_hidden": false, "stickied": false, "created": 1463423225.0, "author_flair_text": null, "created_utc": 1463394425.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d378wbt", "gilded": 0, "archived": false, "report_reasons": null, "author": "Owen_newO", "parent_id": "t1_d378637", "score": 1, "approved_by": null, "controversiality": 0, "body": "Stunning", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Stunning&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d378wbt", "score_hidden": false, "stickied": false, "created": 1463412125.0, "author_flair_text": null, "created_utc": 1463383325.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d37dhff", "gilded": 0, "archived": false, "report_reasons": null, "author": "rauz", "parent_id": "t1_d378637", "score": 1, "approved_by": null, "controversiality": 0, "body": "Was your wish for the manatee to die?", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Was your wish for the manatee to die?&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37dhff", "score_hidden": false, "stickied": false, "created": 1463428584.0, "author_flair_text": null, "created_utc": 1463399784.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d378637", "gilded": 0, "archived": false, "report_reasons": null, "author": "spoonsand4orks", "parent_id": "t3_4jjh7m", "score": 8, "approved_by": null, "controversiality": 0, "body": "When I was around 6 years old, my family and I went out on a boat around the river. Suddenly a large mass emerged out of the water...it was a manatee . I had never seen one before and was very excited. At the time, manatees were very much endangered and were very rare to see in the wild. My mother told me, since it was rare, I should make a wish. Just as I made my wish, the manatee rolled over on its back and was clearly dead. I cried, horrified, as the river police tied a noose around its tail and dragged it off. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I was around 6 years old, my family and I went out on a boat around the river. Suddenly a large mass emerged out of the water...it was a manatee . I had never seen one before and was very excited. At the time, manatees were very much endangered and were very rare to see in the wild. My mother told me, since it was rare, I should make a wish. Just as I made my wish, the manatee rolled over on its back and was clearly dead. I cried, horrified, as the river police tied a noose around its tail and dragged it off. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d378637", "score_hidden": false, "stickied": false, "created": 1463409728.0, "author_flair_text": null, "created_utc": 1463380928.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 8}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d37764y", "gilded": 0, "archived": false, "report_reasons": null, "author": "MilkMakesMePoop", "parent_id": "t1_d375rkd", "score": 1, "approved_by": null, "controversiality": 0, "body": "I bet in hindsight you don't feel so dumb. I bet you just relish your past stupidity. What a lovely thing. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I bet in hindsight you don&amp;#39;t feel so dumb. I bet you just relish your past stupidity. What a lovely thing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37764y", "score_hidden": false, "stickied": false, "created": 1463406771.0, "author_flair_text": null, "created_utc": 1463377971.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d375rkd", "gilded": 0, "archived": false, "report_reasons": null, "author": "adbJ114", "parent_id": "t3_4jjh7m", "score": 6, "approved_by": null, "controversiality": 0, "body": "Once when I was ten I was at a movie theater with a friend and there was a cardboard cutout for the movie Dirty Rotten Scoundrels and the tagline said \"nice guys finish last\" and my friend said he liked the tagline and I said I didn't get it and the guy behind the concessions stand was leering at me and I felt really stupid and lame :(", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Once when I was ten I was at a movie theater with a friend and there was a cardboard cutout for the movie Dirty Rotten Scoundrels and the tagline said &amp;quot;nice guys finish last&amp;quot; and my friend said he liked the tagline and I said I didn&amp;#39;t get it and the guy behind the concessions stand was leering at me and I felt really stupid and lame :(&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d375rkd", "score_hidden": false, "stickied": false, "created": 1463403216.0, "author_flair_text": null, "created_utc": 1463374416.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 6}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d387kh2", "gilded": 0, "archived": false, "report_reasons": null, "author": "z960849", "parent_id": "t1_d3797sa", "score": 1, "approved_by": null, "controversiality": 0, "body": "I don't get it but it does sounds deep.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t get it but it does sounds deep.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d387kh2", "score_hidden": false, "stickied": false, "created": 1463474869.0, "author_flair_text": null, "created_utc": 1463446069.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d3797sa", "gilded": 0, "archived": false, "report_reasons": null, "author": "kreynlan", "parent_id": "t1_d3772ma", "score": 3, "approved_by": null, "controversiality": 0, "body": "I like to think of friends as extensions of oneself. \n\nSo yes, friends are idiots, but they're your idiots.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I like to think of friends as extensions of oneself. &lt;/p&gt;\n\n&lt;p&gt;So yes, friends are idiots, but they&amp;#39;re your idiots.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d3797sa", "score_hidden": false, "stickied": false, "created": 1463413245.0, "author_flair_text": null, "created_utc": 1463384445.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 3}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d3772ma", "gilded": 0, "archived": false, "report_reasons": null, "author": "boosey-hawkes", "parent_id": "t3_4jjh7m", "score": 4, "approved_by": null, "controversiality": 0, "body": "This is a little sad and extremely cringe, and I should probably use a throwaway, but I'm on mobile and I am also very lazy.\n\nSome time ago I was in grade 12 and about to graduate. I wasn't planning on going, but I was pressured to go by some friends. I never had close friends, but I did get pretty well with just about everyone in high school and later I won the friendliest award (whatever that's worth).\n\nMainly, people pressured me to go and ask a certain someone out to prom. Silly me, I took it as a hint of sorts. Well, I figured, no skin off my back, sure! It'd make her happy, and she was pretty nice. I made plans to ask her out as a friend (I'm quite shy, so working up the nerve was tough even for this).\n\nLater, I was told that her parents wouldn't likely want her going out with anyone. Fair enough, I said. I changed gears, and thought of someone else to ask. I thought person B wasn't going to be asked by anyone (through no fault of hers), and she and I were pretty good friends. I didn't want her to feel not included.\n\nUnfortunately, person B caught wind of my initial plan. She then lied to me saying she didn't want to go with anybody, while saying yes to somebody else. No big deal, though I know now that A) she had some feelings for me and B) she must've taken it the wrong way.\n\nTo make matters worse, I was going through a pretty bad depression episode all throughout highschool. I hit bottom in grade 12 and news of that spread like wildfire throughout the school. I attempted and made the mistake of going to the counselors. In my school, they weren't very good and I feel my situation was mishandled.\n\nI've long since graduated, but I still wonder if people think of me as that obsessed crazy kid. I'm definitely wierd and a little clingy, but not that much I swear!\n\nNow I've graduated and now I'm super lonely and have no friends. How does one make those?\n\n**TL;DR** don't listen to friends. They're idiots", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a little sad and extremely cringe, and I should probably use a throwaway, but I&amp;#39;m on mobile and I am also very lazy.&lt;/p&gt;\n\n&lt;p&gt;Some time ago I was in grade 12 and about to graduate. I wasn&amp;#39;t planning on going, but I was pressured to go by some friends. I never had close friends, but I did get pretty well with just about everyone in high school and later I won the friendliest award (whatever that&amp;#39;s worth).&lt;/p&gt;\n\n&lt;p&gt;Mainly, people pressured me to go and ask a certain someone out to prom. Silly me, I took it as a hint of sorts. Well, I figured, no skin off my back, sure! It&amp;#39;d make her happy, and she was pretty nice. I made plans to ask her out as a friend (I&amp;#39;m quite shy, so working up the nerve was tough even for this).&lt;/p&gt;\n\n&lt;p&gt;Later, I was told that her parents wouldn&amp;#39;t likely want her going out with anyone. Fair enough, I said. I changed gears, and thought of someone else to ask. I thought person B wasn&amp;#39;t going to be asked by anyone (through no fault of hers), and she and I were pretty good friends. I didn&amp;#39;t want her to feel not included.&lt;/p&gt;\n\n&lt;p&gt;Unfortunately, person B caught wind of my initial plan. She then lied to me saying she didn&amp;#39;t want to go with anybody, while saying yes to somebody else. No big deal, though I know now that A) she had some feelings for me and B) she must&amp;#39;ve taken it the wrong way.&lt;/p&gt;\n\n&lt;p&gt;To make matters worse, I was going through a pretty bad depression episode all throughout highschool. I hit bottom in grade 12 and news of that spread like wildfire throughout the school. I attempted and made the mistake of going to the counselors. In my school, they weren&amp;#39;t very good and I feel my situation was mishandled.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve long since graduated, but I still wonder if people think of me as that obsessed crazy kid. I&amp;#39;m definitely wierd and a little clingy, but not that much I swear!&lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;ve graduated and now I&amp;#39;m super lonely and have no friends. How does one make those?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;TL;DR&lt;/strong&gt; don&amp;#39;t listen to friends. They&amp;#39;re idiots&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d3772ma", "score_hidden": false, "stickied": false, "created": 1463406504.0, "author_flair_text": null, "created_utc": 1463377704.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 4}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d375vwo", "gilded": 0, "archived": false, "report_reasons": null, "author": "dr_G7", "parent_id": "t3_4jjh7m", "score": 3, "approved_by": null, "controversiality": 0, "body": "Pretty fun one was one time I got busted for supplying a party with booze without even attending. I was leaving to visit family in Canada the next morning but my buddies parents were out of town, and asked to pick up 4 cases of beer for the party, I was the only one of my friends that had a fake ID at the time (think like 17 in high school), so I go to the store, put the beer on the counter, first time ever trying to purchase with the fake, and the guy doesn't even ID me. I go home, go to bed and figure all is good with the world. So we go to Canada the next morning and my friend that had the party got busted by a neighbour next door and asked where we got the beer, the fucker told him it was me (never was any good at pressure situations), and I came home after 5 days in Canada to a voicemail from someone's parents saying I bought beer for the party and my mom grounded me and took my fake ID away.\n\nTL;DR - Got busted for supplying beer to a party I didn't even attend.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Pretty fun one was one time I got busted for supplying a party with booze without even attending. I was leaving to visit family in Canada the next morning but my buddies parents were out of town, and asked to pick up 4 cases of beer for the party, I was the only one of my friends that had a fake ID at the time (think like 17 in high school), so I go to the store, put the beer on the counter, first time ever trying to purchase with the fake, and the guy doesn&amp;#39;t even ID me. I go home, go to bed and figure all is good with the world. So we go to Canada the next morning and my friend that had the party got busted by a neighbour next door and asked where we got the beer, the fucker told him it was me (never was any good at pressure situations), and I came home after 5 days in Canada to a voicemail from someone&amp;#39;s parents saying I bought beer for the party and my mom grounded me and took my fake ID away.&lt;/p&gt;\n\n&lt;p&gt;TL;DR - Got busted for supplying beer to a party I didn&amp;#39;t even attend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d375vwo", "score_hidden": false, "stickied": false, "created": 1463403499.0, "author_flair_text": null, "created_utc": 1463374699.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": {"kind": "Listing", "data": {"modhash": "", "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d380p9z", "gilded": 0, "archived": false, "report_reasons": null, "author": "tinymanwhat", "parent_id": "t1_d37xhg7", "score": 2, "approved_by": null, "controversiality": 0, "body": "you too!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you too!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d380p9z", "score_hidden": false, "stickied": false, "created": 1463464213.0, "author_flair_text": null, "created_utc": 1463435413.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d37xhg7", "gilded": 0, "archived": false, "report_reasons": null, "author": "elephanilla", "parent_id": "t1_d37ng3o", "score": 1, "approved_by": null, "controversiality": 0, "body": "Exactly! That's one of my reasons too. People dedicating their time towards years of schooling and paying countless dollars only to be told that \"God\" saved that patient, not your hard work. \nThanks for the reply, it's refreshing to hear someone with such similar views. Have a great day!", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Exactly! That&amp;#39;s one of my reasons too. People dedicating their time towards years of schooling and paying countless dollars only to be told that &amp;quot;God&amp;quot; saved that patient, not your hard work. \nThanks for the reply, it&amp;#39;s refreshing to hear someone with such similar views. Have a great day!&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37xhg7", "score_hidden": false, "stickied": false, "created": 1463459646.0, "author_flair_text": null, "created_utc": 1463430846.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d37ng3o", "gilded": 0, "archived": false, "report_reasons": null, "author": "tinymanwhat", "parent_id": "t1_d377169", "score": 2, "approved_by": null, "controversiality": 0, "body": "When I got out of the hospital after a week, I had all these people telling me that God saved me or whatever. It's hard to put into words, but a god that can save people from death should also be able to prevent those situations. Also some people had said that God was with me in the OR, and to me, the only people who should be thanked are the surgeons. They dedicated their lives to what they do and I'm alive because of them, not divine intervention. I remember reading once about an ex-pastor who said he stopped believing because he heard about a plane crash with one survivor and people said that god saved that one person because they were destined for greatness, which is shitty because it means he also intended to kill all those other people and for what? That's the best explanation I can give, but I do have a lot of other reasons for being an atheist", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When I got out of the hospital after a week, I had all these people telling me that God saved me or whatever. It&amp;#39;s hard to put into words, but a god that can save people from death should also be able to prevent those situations. Also some people had said that God was with me in the OR, and to me, the only people who should be thanked are the surgeons. They dedicated their lives to what they do and I&amp;#39;m alive because of them, not divine intervention. I remember reading once about an ex-pastor who said he stopped believing because he heard about a plane crash with one survivor and people said that god saved that one person because they were destined for greatness, which is shitty because it means he also intended to kill all those other people and for what? That&amp;#39;s the best explanation I can give, but I do have a lot of other reasons for being an atheist&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37ng3o", "score_hidden": false, "stickied": false, "created": 1463445812.0, "author_flair_text": null, "created_utc": 1463417012.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d377169", "gilded": 0, "archived": false, "report_reasons": null, "author": "elephanilla", "parent_id": "t1_d376pwo", "score": 1, "approved_by": null, "controversiality": 0, "body": "Would you mind going a little more in depth about the not believing in God part? I was taken back whenever I read \"don't\"! I'm an atheist and would love to hear your say in this. Most people I know would say \"I'm alive because of Him\" or \"He saved my life\", or something along those lines.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Would you mind going a little more in depth about the not believing in God part? I was taken back whenever I read &amp;quot;don&amp;#39;t&amp;quot;! I&amp;#39;m an atheist and would love to hear your say in this. Most people I know would say &amp;quot;I&amp;#39;m alive because of Him&amp;quot; or &amp;quot;He saved my life&amp;quot;, or something along those lines.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d377169", "score_hidden": false, "stickied": false, "created": 1463406396.0, "author_flair_text": null, "created_utc": 1463377596.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}], "after": null, "before": null}}, "user_reports": [], "saved": false, "id": "d376pwo", "gilded": 0, "archived": false, "report_reasons": null, "author": "tinymanwhat", "parent_id": "t3_4jjh7m", "score": 3, "approved_by": null, "controversiality": 0, "body": "The summer after 7th grade, my family went with another family we were all friends with to the beach in NC for a week. The last day we were going to be there we decided to go tubing on the Intercoastal Waterway. I was on the right side of the tube, and after about 15 minutes of tubing, the boat turned around so that the tube swung out counter-clockwise. I slammed my head against a nearby dock and fractured my skull. I probably should have died. The next day, surgeons at Duke were able to drain a buildup of blood within my head. I spent a week in the hospital after that and another three bedridden at home. It's one of the reasons I don't believe in God. Thankfully, I'm completely normal, save for a slight ridge in my skull on the right side of my head", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The summer after 7th grade, my family went with another family we were all friends with to the beach in NC for a week. The last day we were going to be there we decided to go tubing on the Intercoastal Waterway. I was on the right side of the tube, and after about 15 minutes of tubing, the boat turned around so that the tube swung out counter-clockwise. I slammed my head against a nearby dock and fractured my skull. I probably should have died. The next day, surgeons at Duke were able to drain a buildup of blood within my head. I spent a week in the hospital after that and another three bedridden at home. It&amp;#39;s one of the reasons I don&amp;#39;t believe in God. Thankfully, I&amp;#39;m completely normal, save for a slight ridge in my skull on the right side of my head&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d376pwo", "score_hidden": false, "stickied": false, "created": 1463405570.0, "author_flair_text": null, "created_utc": 1463376770.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d37baju", "gilded": 0, "archived": false, "report_reasons": null, "author": "chelcdora", "parent_id": "t3_4jjh7m", "score": 3, "approved_by": null, "controversiality": 0, "body": "I was chilling with some buddies and my phone rings in the other room. I can't be bothered to get it. Then it rings again. And again. The fourth time it rings I get up. I miss it. My best friend called me four times in a row and she only does that when she REALLY needs to get in touch. So I ring her back and she's crying. She's crying so much that she can't answer me when I ask whats wrong. I'm feeling sick in my stomach. Who died? Finally she starts wailing WE LOST EUROVISION!!!\n\nI fucking hate my best friend.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I was chilling with some buddies and my phone rings in the other room. I can&amp;#39;t be bothered to get it. Then it rings again. And again. The fourth time it rings I get up. I miss it. My best friend called me four times in a row and she only does that when she REALLY needs to get in touch. So I ring her back and she&amp;#39;s crying. She&amp;#39;s crying so much that she can&amp;#39;t answer me when I ask whats wrong. I&amp;#39;m feeling sick in my stomach. Who died? Finally she starts wailing WE LOST EUROVISION!!!&lt;/p&gt;\n\n&lt;p&gt;I fucking hate my best friend.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37baju", "score_hidden": false, "stickied": false, "created": 1463421387.0, "author_flair_text": null, "created_utc": 1463392587.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 3}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d37a8nr", "gilded": 0, "archived": false, "report_reasons": null, "author": "RhythmicBreak", "parent_id": "t3_4jjh7m", "score": 2, "approved_by": null, "controversiality": 0, "body": "Lazy eye runs in my family. At the time, surgery was offered at a very young age to strengthen the muscles behind the eyeball, requiring its removal and reinsertion after the muscles are tightened. Thanks to Science, you can get that surgery at any age now.\n\nPoint being, I had the surgery as a tiny baby, and so did my little sister. I was about ten when she was a couple of months old and she got her surgery.\n\nThe surgery is not very severe, but you don't come out of it looking too great. Your face is pretty bruised, you get a very severe black eye, and your eye(s) are bloodshot for a good week or two afterwards.\n\nMy mom had errands to run and didn't trust me alone with my baby sister, and my dad was at work. So she took me and my sister - a few days out of surgery - to the grocery store.\n\nThings were fine until we were waiting in line, and my sister grabbed a magazine off the shelf. My mom said no and took it away from her.\n\nMistake.\n\nOne of the side effects to the surgery is that, based off the work they do to tighten your muscles behind your eyeball, and since they do literally remove your eye from its socket... If you cry, you will cry blood.\n\nSo we were standing in line with a crying baby with a bruised face and a black eye, crying copious amounts of blood.\n\nMy mom was probably mortified. My mom was also suddenly okay with me babysitting at that age afterwards.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Lazy eye runs in my family. At the time, surgery was offered at a very young age to strengthen the muscles behind the eyeball, requiring its removal and reinsertion after the muscles are tightened. Thanks to Science, you can get that surgery at any age now.&lt;/p&gt;\n\n&lt;p&gt;Point being, I had the surgery as a tiny baby, and so did my little sister. I was about ten when she was a couple of months old and she got her surgery.&lt;/p&gt;\n\n&lt;p&gt;The surgery is not very severe, but you don&amp;#39;t come out of it looking too great. Your face is pretty bruised, you get a very severe black eye, and your eye(s) are bloodshot for a good week or two afterwards.&lt;/p&gt;\n\n&lt;p&gt;My mom had errands to run and didn&amp;#39;t trust me alone with my baby sister, and my dad was at work. So she took me and my sister - a few days out of surgery - to the grocery store.&lt;/p&gt;\n\n&lt;p&gt;Things were fine until we were waiting in line, and my sister grabbed a magazine off the shelf. My mom said no and took it away from her.&lt;/p&gt;\n\n&lt;p&gt;Mistake.&lt;/p&gt;\n\n&lt;p&gt;One of the side effects to the surgery is that, based off the work they do to tighten your muscles behind your eyeball, and since they do literally remove your eye from its socket... If you cry, you will cry blood.&lt;/p&gt;\n\n&lt;p&gt;So we were standing in line with a crying baby with a bruised face and a black eye, crying copious amounts of blood.&lt;/p&gt;\n\n&lt;p&gt;My mom was probably mortified. My mom was also suddenly okay with me babysitting at that age afterwards.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37a8nr", "score_hidden": false, "stickied": false, "created": 1463417155.0, "author_flair_text": null, "created_utc": 1463388355.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d37d45t", "gilded": 0, "archived": false, "report_reasons": null, "author": "Captain_Ne", "parent_id": "t3_4jjh7m", "score": 2, "approved_by": null, "controversiality": 0, "body": "At 20, I went into job corps. I had no work experience and no drivers licence so it seemed a good idea. (It was, not for the reasons advertised but that's a really long story) Two weeks before I left I got a message from a girl I'd know since elementary school. I'm gonna call her Sara. We didn't have anything in common anymore, she'd talked about nothing but cheerleading and horses and I'd discovered black hair dye and was more interested in video games and anime. Sara kept asking me to come hang out with her before I left. She'd send me messages on MySpace, MSN messenger and kept calling my house. I got annoyed and I told her we had nothing in common, we were only hanging out because we'd known each other as long as had and I didn't wanna be friends with her. She asked me several times if I was sure, I said yes and started ignoring her messages. Deleted her off Facebook and didn't think about it again.\n\nAbout two weeks after I got into job corps, I go back to my dorm room and there's a voice mail on my cellphone. It's my dad's girlfriend tell me to call as soon as I can. When I do she tells Sara went into a diabetic coma, she was in it for several days and lost brain function. Her family made the decision to unplug her and she passed away. I didn't know how to feel about it and I still don't.\n\nI wonder if it would have been better to have just hung out with her once before I left and never went off on that tirade. Honestly, what I'd said was true but maybe it would have just been better to let the friendship fall apart due to distance then spew out all my annoyance at her in one message basically a month before she died. It makes me feel bad sometimes and it's been 10 years.\n\nEdit: word", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;At 20, I went into job corps. I had no work experience and no drivers licence so it seemed a good idea. (It was, not for the reasons advertised but that&amp;#39;s a really long story) Two weeks before I left I got a message from a girl I&amp;#39;d know since elementary school. I&amp;#39;m gonna call her Sara. We didn&amp;#39;t have anything in common anymore, she&amp;#39;d talked about nothing but cheerleading and horses and I&amp;#39;d discovered black hair dye and was more interested in video games and anime. Sara kept asking me to come hang out with her before I left. She&amp;#39;d send me messages on MySpace, MSN messenger and kept calling my house. I got annoyed and I told her we had nothing in common, we were only hanging out because we&amp;#39;d known each other as long as had and I didn&amp;#39;t wanna be friends with her. She asked me several times if I was sure, I said yes and started ignoring her messages. Deleted her off Facebook and didn&amp;#39;t think about it again.&lt;/p&gt;\n\n&lt;p&gt;About two weeks after I got into job corps, I go back to my dorm room and there&amp;#39;s a voice mail on my cellphone. It&amp;#39;s my dad&amp;#39;s girlfriend tell me to call as soon as I can. When I do she tells Sara went into a diabetic coma, she was in it for several days and lost brain function. Her family made the decision to unplug her and she passed away. I didn&amp;#39;t know how to feel about it and I still don&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;I wonder if it would have been better to have just hung out with her once before I left and never went off on that tirade. Honestly, what I&amp;#39;d said was true but maybe it would have just been better to let the friendship fall apart due to distance then spew out all my annoyance at her in one message basically a month before she died. It makes me feel bad sometimes and it&amp;#39;s been 10 years.&lt;/p&gt;\n\n&lt;p&gt;Edit: word&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37d45t", "score_hidden": false, "stickied": false, "created": 1463427533.0, "author_flair_text": null, "created_utc": 1463398733.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d37dk09", "gilded": 0, "archived": false, "report_reasons": null, "author": "batty3108", "parent_id": "t3_4jjh7m", "score": 2, "approved_by": null, "controversiality": 0, "body": "A friend of a friend of my fiancée's made out with a necrophiliac/cannibal possible rapist/murderer.\n\nShe was on holiday somewhere (I want to say Amsterdam or Copenhagen) with friends, met a guy in a bar, hit it off, made out a bit. He invited her to come back to his. She initially went with him, but changed her mind at the door. No problem, he wasn't in the least bit unpleasant about it.\n\nA few days after she got home, she had a rash or some sort of reaction around her mouth that got pretty unsightly and painful, so she went to the doctor. They started asking about her job, whether she worked with dead bodies etc, which she didn't (she was a consultant or something like that). Once that was established, she was asked about recent sexual partners, and the guy abroad was mentioned. Soon, the doctor had to call the police to get involved.\n\nApparently, this rash is something you catch from contact with dead bodies, and the fact that it was transmitted via mouth-to-mouth contact meant this guy had probably been either kissing or *eating* dead people, and it wasn't much of a stretch to consider that he'd killed whoever he was doing that too.\n\nIIRC, the report was passed on to the police in whatever city the bloke lived in, who launched an investigation.", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A friend of a friend of my fiancée&amp;#39;s made out with a necrophiliac/cannibal possible rapist/murderer.&lt;/p&gt;\n\n&lt;p&gt;She was on holiday somewhere (I want to say Amsterdam or Copenhagen) with friends, met a guy in a bar, hit it off, made out a bit. He invited her to come back to his. She initially went with him, but changed her mind at the door. No problem, he wasn&amp;#39;t in the least bit unpleasant about it.&lt;/p&gt;\n\n&lt;p&gt;A few days after she got home, she had a rash or some sort of reaction around her mouth that got pretty unsightly and painful, so she went to the doctor. They started asking about her job, whether she worked with dead bodies etc, which she didn&amp;#39;t (she was a consultant or something like that). Once that was established, she was asked about recent sexual partners, and the guy abroad was mentioned. Soon, the doctor had to call the police to get involved.&lt;/p&gt;\n\n&lt;p&gt;Apparently, this rash is something you catch from contact with dead bodies, and the fact that it was transmitted via mouth-to-mouth contact meant this guy had probably been either kissing or &lt;em&gt;eating&lt;/em&gt; dead people, and it wasn&amp;#39;t much of a stretch to consider that he&amp;#39;d killed whoever he was doing that too.&lt;/p&gt;\n\n&lt;p&gt;IIRC, the report was passed on to the police in whatever city the bloke lived in, who launched an investigation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37dk09", "score_hidden": false, "stickied": false, "created": 1463428780.0, "author_flair_text": null, "created_utc": 1463399980.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 2}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d378vu1", "gilded": 0, "archived": false, "report_reasons": null, "author": "chicke1129", "parent_id": "t3_4jjh7m", "score": 1, "approved_by": null, "controversiality": 0, "body": "So I'm a fashion model. I've booked a couple of big things here or there, nothing absolutely super-model life changing, but I've been able to live comfortably and freely for the past couple years through my modeling work.\n\nAnyway, last year I got a call from my agent that I would be meeting with sports illustrated to potentially shoot for their swimsuit issue. It's important that you understand that Sports illustrated has literally been THE dream job for me since I started modeling, so I'm ecstatic about what this opportunity could mean for my career. sports illustrated's swimsuit issue is known to be a bit of a game-changer for the careers of girls who book it. \n\nSo... I get the call that I will be meeting with them a couple of weeks in advance, I'm stoked, start working out and buying a bunch of face products to make sure that I'm glowing and looking my absolute best the day that I walk in there. \n\nFast forward to the weekend before I have my meeting--- It just so happened to be Labor Day weekend and my boyfriend-at -the-time and I decided to head to his hometown for the long weekend. We're at a BBQ out on his friends back patio deck, I'm a little drunk and his friend whips out some hot dogs that he's about to throw on the grill. Next thing I know I take a bite into the hot dog and I feel something fall out of my mouth.. I see whatever it was slowly fall though the cracks of the wooden boards in the patio deck... I whip out my iPhone front facing camera.... and see that one of my teeth has fallen out.\n\nOn a side note, you should know that I've had a faulty false tooth since I was about 16 years old, it was a canine tooth that never grew in so I had to have all this crazy oral surgery and basically ended up having a shitty dentist install a shitty fake tooth that ended up falling out quite often, like twice a year, which was always super convenient for my modeling career. Whenever it would fall out the dentist would just re-cement the crown back in. Since this story I've had an oral surgeon go back in and fix things up.\n\nso, back to the BBQ, I see that my tooth has fallen out and I start to panic, mind you I'm a little drunk so the complete reality of the situation hasn't completely set in....\nI get on my hands and knees and turn on my iPhone flashlight to start looking through the floorboards of the back patio to see if I'm going to find the crown/tooth that fell out. All of these people at the party are wondering WTF I'm doing but I don't care. I see with the flashlight that there is a good amount of space between the floorboards and the actual ground (which was covered in dirt and leaves and twigs), so the chances of me finding this teeny tiny tooth of mine are pretty slim. reality sets in and I think about my upcoming meeting in three days which just so happens to be the biggest meeting of my life and I pull my boyfriend aside and relay my anxiety/panic attack onto him, explain to him that I'm a toothless swimsuit model and how am I supposed to be sexy if I look like a crazy person etc etc, basically start losing it and throw a huge tantrum, run to his car and start bawling my eyes out.\n\nSo while I'm in the car I'm having a full blown panic attack being really dramatic and not able to contain myself, my boyfriend comes back and tries to console me, but there's literally nothing that will bring me back to reality at this point other than the discovery of my missing tooth..\n\nsoooo....\n\nI continue to freak out for about 5 more minutes and then I hear my boyfriends name being screamed from back at the party. his friend comes over to the car with his hands clasped together.... low and behold my missing tooth was in the palm of this friends hand. this friend who I had literally just met this night. he spent a good twenty minutes looking for my tooth through the floorboards while I was being a prissy bitch having a freak out and actually FOUND it. and not only FOUND it, but was able to retrieve it through the floorboards. he told me that he was able to extract the tooth from beneath the floorboards by getting a stick that would fit through the cracks, and he put a piece of tape on the end of the stick, and was then able to stick the tape end of the stick to the tooth in the dirt, and successfully rise it back up through the floorboards without the tooth unsticking from the tape.\n\nI'm not sure if I've ever experienced more shock and disbelief ever...... I hug and kiss and thank my boyfriends friend and we go back to the party and everything is great, I get back to NYC and find a dentist who is able to cement the tooth back in for me temporarily for my meeting. \n\nThe meeting went well, I ended up not booking the job but I got a hell of a good story out of the whole deal.\n\n", "edited": 1463383641.0, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So I&amp;#39;m a fashion model. I&amp;#39;ve booked a couple of big things here or there, nothing absolutely super-model life changing, but I&amp;#39;ve been able to live comfortably and freely for the past couple years through my modeling work.&lt;/p&gt;\n\n&lt;p&gt;Anyway, last year I got a call from my agent that I would be meeting with sports illustrated to potentially shoot for their swimsuit issue. It&amp;#39;s important that you understand that Sports illustrated has literally been THE dream job for me since I started modeling, so I&amp;#39;m ecstatic about what this opportunity could mean for my career. sports illustrated&amp;#39;s swimsuit issue is known to be a bit of a game-changer for the careers of girls who book it. &lt;/p&gt;\n\n&lt;p&gt;So... I get the call that I will be meeting with them a couple of weeks in advance, I&amp;#39;m stoked, start working out and buying a bunch of face products to make sure that I&amp;#39;m glowing and looking my absolute best the day that I walk in there. &lt;/p&gt;\n\n&lt;p&gt;Fast forward to the weekend before I have my meeting--- It just so happened to be Labor Day weekend and my boyfriend-at -the-time and I decided to head to his hometown for the long weekend. We&amp;#39;re at a BBQ out on his friends back patio deck, I&amp;#39;m a little drunk and his friend whips out some hot dogs that he&amp;#39;s about to throw on the grill. Next thing I know I take a bite into the hot dog and I feel something fall out of my mouth.. I see whatever it was slowly fall though the cracks of the wooden boards in the patio deck... I whip out my iPhone front facing camera.... and see that one of my teeth has fallen out.&lt;/p&gt;\n\n&lt;p&gt;On a side note, you should know that I&amp;#39;ve had a faulty false tooth since I was about 16 years old, it was a canine tooth that never grew in so I had to have all this crazy oral surgery and basically ended up having a shitty dentist install a shitty fake tooth that ended up falling out quite often, like twice a year, which was always super convenient for my modeling career. Whenever it would fall out the dentist would just re-cement the crown back in. Since this story I&amp;#39;ve had an oral surgeon go back in and fix things up.&lt;/p&gt;\n\n&lt;p&gt;so, back to the BBQ, I see that my tooth has fallen out and I start to panic, mind you I&amp;#39;m a little drunk so the complete reality of the situation hasn&amp;#39;t completely set in....\nI get on my hands and knees and turn on my iPhone flashlight to start looking through the floorboards of the back patio to see if I&amp;#39;m going to find the crown/tooth that fell out. All of these people at the party are wondering WTF I&amp;#39;m doing but I don&amp;#39;t care. I see with the flashlight that there is a good amount of space between the floorboards and the actual ground (which was covered in dirt and leaves and twigs), so the chances of me finding this teeny tiny tooth of mine are pretty slim. reality sets in and I think about my upcoming meeting in three days which just so happens to be the biggest meeting of my life and I pull my boyfriend aside and relay my anxiety/panic attack onto him, explain to him that I&amp;#39;m a toothless swimsuit model and how am I supposed to be sexy if I look like a crazy person etc etc, basically start losing it and throw a huge tantrum, run to his car and start bawling my eyes out.&lt;/p&gt;\n\n&lt;p&gt;So while I&amp;#39;m in the car I&amp;#39;m having a full blown panic attack being really dramatic and not able to contain myself, my boyfriend comes back and tries to console me, but there&amp;#39;s literally nothing that will bring me back to reality at this point other than the discovery of my missing tooth..&lt;/p&gt;\n\n&lt;p&gt;soooo....&lt;/p&gt;\n\n&lt;p&gt;I continue to freak out for about 5 more minutes and then I hear my boyfriends name being screamed from back at the party. his friend comes over to the car with his hands clasped together.... low and behold my missing tooth was in the palm of this friends hand. this friend who I had literally just met this night. he spent a good twenty minutes looking for my tooth through the floorboards while I was being a prissy bitch having a freak out and actually FOUND it. and not only FOUND it, but was able to retrieve it through the floorboards. he told me that he was able to extract the tooth from beneath the floorboards by getting a stick that would fit through the cracks, and he put a piece of tape on the end of the stick, and was then able to stick the tape end of the stick to the tooth in the dirt, and successfully rise it back up through the floorboards without the tooth unsticking from the tape.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if I&amp;#39;ve ever experienced more shock and disbelief ever...... I hug and kiss and thank my boyfriends friend and we go back to the party and everything is great, I get back to NYC and find a dentist who is able to cement the tooth back in for me temporarily for my meeting. &lt;/p&gt;\n\n&lt;p&gt;The meeting went well, I ended up not booking the job but I got a hell of a good story out of the whole deal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d378vu1", "score_hidden": false, "stickied": false, "created": 1463412078.0, "author_flair_text": null, "created_utc": 1463383278.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d37h87s", "gilded": 0, "archived": false, "report_reasons": null, "author": "ab00", "parent_id": "t3_4jjh7m", "score": 1, "approved_by": null, "controversiality": 0, "body": "Considering this gets asked once a week and has done for ages now, there cant be that many left....", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Considering this gets asked once a week and has done for ages now, there cant be that many left....&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37h87s", "score_hidden": false, "stickied": false, "created": 1463436469.0, "author_flair_text": null, "created_utc": 1463407669.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d37lj5r", "gilded": 0, "archived": false, "report_reasons": null, "author": "SevenSixOne", "parent_id": "t3_4jjh7m", "score": 1, "approved_by": null, "controversiality": 0, "body": "In the very early days of the internet (c. 1995), I got an AOL instant message out of the blue from someone who claimed to be Christian Slater. \n\nTheir icebreaker was “Hello I am Christian Slater”, their AOL profile had Christian Slater’s real birthdate/hometown/etc, and the “favorite movies” section just listed every movie Christian Slater had ever been in. \n\nIt was a good thing I had just seen *Heathers*, because otherwise I would have had no idea who he was. I didn’t really care that I was (allegedly) talking to Mister Big Hollywood Star Guy Christian Slater, but I got a weird thrill out of how ANGRY this stranger got with my indifference. \n\nThis person probably thought Christian Slater was the biggest star they could pretend to be and still have some people believe it… but I like to imagine that I really *was* talking to Christian Slater, who was getting increasingly frustrated that I didn’t even seem to care. ", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;In the very early days of the internet (c. 1995), I got an AOL instant message out of the blue from someone who claimed to be Christian Slater. &lt;/p&gt;\n\n&lt;p&gt;Their icebreaker was “Hello I am Christian Slater”, their AOL profile had Christian Slater’s real birthdate/hometown/etc, and the “favorite movies” section just listed every movie Christian Slater had ever been in. &lt;/p&gt;\n\n&lt;p&gt;It was a good thing I had just seen &lt;em&gt;Heathers&lt;/em&gt;, because otherwise I would have had no idea who he was. I didn’t really care that I was (allegedly) talking to Mister Big Hollywood Star Guy Christian Slater, but I got a weird thrill out of how ANGRY this stranger got with my indifference. &lt;/p&gt;\n\n&lt;p&gt;This person probably thought Christian Slater was the biggest star they could pretend to be and still have some people believe it… but I like to imagine that I really &lt;em&gt;was&lt;/em&gt; talking to Christian Slater, who was getting increasingly frustrated that I didn’t even seem to care. &lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d37lj5r", "score_hidden": false, "stickied": false, "created": 1463443048.0, "author_flair_text": null, "created_utc": 1463414248.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": 1}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qh1i", "banned_by": null, "removal_reason": null, "link_id": "t3_4jjh7m", "likes": null, "replies": "", "user_reports": [], "saved": false, "id": "d374i8e", "gilded": 0, "archived": false, "report_reasons": null, "author": "FrankBurlyPI", "parent_id": "t3_4jjh7m", "score": -2, "approved_by": null, "controversiality": 1, "body": "I had a really great little league coach. His advice improved my game a lot\n\n I’ll never forget the time he yelled ‘Hey,  look alive out there!”\n\nUp to that point I had been lying face down in the dirt surrounded by a pool of fake blood. My theory was that most people would be hesitant to step on a dead child just to reach base safely.\n\nI followed his advice about looking alive. While it wasn’t perfect, it was an improvement. To make sure there was no doubt about the fact that I was still among the living I would play the entire game while I was hooked up to an EKG machine. Of course dragging the machine around with me cut down on my defensive range quite a bit. They’re a lot heaver than they look on TV.\n\nAnd once I gave myself a pretty good scare by accidentally unplugging the extension cord without realizing it.  So for a half inning I thought my heart had stopped beating. That was worrisome. I’m not a doctor, but that just didn’t seem right. But all things considered his advice was an improvement.\n\nAt least while I was looking alive I didn’t get nearly as many cleat marks on my back. Those hurt a lot.\n", "edited": false, "author_flair_css_class": null, "downs": 0, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I had a really great little league coach. His advice improved my game a lot&lt;/p&gt;\n\n&lt;p&gt;I’ll never forget the time he yelled ‘Hey,  look alive out there!”&lt;/p&gt;\n\n&lt;p&gt;Up to that point I had been lying face down in the dirt surrounded by a pool of fake blood. My theory was that most people would be hesitant to step on a dead child just to reach base safely.&lt;/p&gt;\n\n&lt;p&gt;I followed his advice about looking alive. While it wasn’t perfect, it was an improvement. To make sure there was no doubt about the fact that I was still among the living I would play the entire game while I was hooked up to an EKG machine. Of course dragging the machine around with me cut down on my defensive range quite a bit. They’re a lot heaver than they look on TV.&lt;/p&gt;\n\n&lt;p&gt;And once I gave myself a pretty good scare by accidentally unplugging the extension cord without realizing it.  So for a half inning I thought my heart had stopped beating. That was worrisome. I’m not a doctor, but that just didn’t seem right. But all things considered his advice was an improvement.&lt;/p&gt;\n\n&lt;p&gt;At least while I was looking alive I didn’t get nearly as many cleat marks on my back. Those hurt a lot.&lt;/p&gt;\n&lt;/div&gt;", "subreddit": "AskReddit", "name": "t1_d374i8e", "score_hidden": false, "stickied": false, "created": 1463400426.0, "author_flair_text": null, "created_utc": 1463371626.0, "distinguished": null, "mod_reports": [], "num_reports": null, "ups": -2}}], "after": null, "before": null}}]